Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_IER3_IAIE127            (0x1u<<31)
#define IAC_IER3_IAIE126            (0x1u<<30)
#define IAC_IER3_IAIE125            (0x1u<<29)
#define IAC_IER3_IAIE124            (0x1u<<28)
#define IAC_IER3_IAIE123            (0x1u<<27)
#define IAC_IER3_IAIE122            (0x1u<<26)
#define IAC_IER3_IAIE121            (0x1u<<25)
#define IAC_IER3_IAIE120            (0x1u<<24)
#define IAC_IER3_IAIE119            (0x1u<<23)
#define IAC_IER3_IAIE118            (0x1u<<22)
#define IAC_IER3_IAIE117            (0x1u<<21)
#define IAC_IER3_IAIE116            (0x1u<<20)
#define IAC_IER3_IAIE115            (0x1u<<19)
#define IAC_IER3_IAIE114            (0x1u<<18)
#define IAC_IER3_IAIE113            (0x1u<<17)
#define IAC_IER3_IAIE112            (0x1u<<16)
#define IAC_IER3_IAIE111            (0x1u<<15)
#define IAC_IER3_IAIE110            (0x1u<<14)
#define IAC_IER3_IAIE109            (0x1u<<13)
#define IAC_IER3_IAIE108            (0x1u<<12)
#define IAC_IER3_IAIE107            (0x1u<<11)
#define IAC_IER3_IAIE106            (0x1u<<10)
#define IAC_IER3_IAIE105            (0x1u<<9)
#define IAC_IER3_IAIE104            (0x1u<<8)
#define IAC_IER3_IAIE103            (0x1u<<7)
#define IAC_IER3_IAIE102            (0x1u<<6)
#define IAC_IER3_IAIE101            (0x1u<<5)
#define IAC_IER3_IAIE100            (0x1u<<4)
#define IAC_IER3_IAIE99             (0x1u<<3)
#define IAC_IER3_IAIE98             (0x1u<<2)
#define IAC_IER3_IAIE97             (0x1u<<1)
#define IAC_IER3_IAIE96             (0x1u<<0)

#define IAC_IER3_IAIE127_B_0X0      (0x0u<<31)
#define IAC_IER3_IAIE127_B_0X1      (0x1u<<31)
#define IAC_IER3_IAIE126_B_0X0      (0x0u<<30)
#define IAC_IER3_IAIE126_B_0X1      (0x1u<<30)
#define IAC_IER3_IAIE125_B_0X0      (0x0u<<29)
#define IAC_IER3_IAIE125_B_0X1      (0x1u<<29)
#define IAC_IER3_IAIE124_B_0X0      (0x0u<<28)
#define IAC_IER3_IAIE124_B_0X1      (0x1u<<28)
#define IAC_IER3_IAIE123_B_0X0      (0x0u<<27)
#define IAC_IER3_IAIE123_B_0X1      (0x1u<<27)
#define IAC_IER3_IAIE122_B_0X0      (0x0u<<26)
#define IAC_IER3_IAIE122_B_0X1      (0x1u<<26)
#define IAC_IER3_IAIE121_B_0X0      (0x0u<<25)
#define IAC_IER3_IAIE121_B_0X1      (0x1u<<25)
#define IAC_IER3_IAIE120_B_0X0      (0x0u<<24)
#define IAC_IER3_IAIE120_B_0X1      (0x1u<<24)
#define IAC_IER3_IAIE119_B_0X0      (0x0u<<23)
#define IAC_IER3_IAIE119_B_0X1      (0x1u<<23)
#define IAC_IER3_IAIE118_B_0X0      (0x0u<<22)
#define IAC_IER3_IAIE118_B_0X1      (0x1u<<22)
#define IAC_IER3_IAIE117_B_0X0      (0x0u<<21)
#define IAC_IER3_IAIE117_B_0X1      (0x1u<<21)
#define IAC_IER3_IAIE116_B_0X0      (0x0u<<20)
#define IAC_IER3_IAIE116_B_0X1      (0x1u<<20)
#define IAC_IER3_IAIE115_B_0X0      (0x0u<<19)
#define IAC_IER3_IAIE115_B_0X1      (0x1u<<19)
#define IAC_IER3_IAIE114_B_0X0      (0x0u<<18)
#define IAC_IER3_IAIE114_B_0X1      (0x1u<<18)
#define IAC_IER3_IAIE113_B_0X0      (0x0u<<17)
#define IAC_IER3_IAIE113_B_0X1      (0x1u<<17)
#define IAC_IER3_IAIE112_B_0X0      (0x0u<<16)
#define IAC_IER3_IAIE112_B_0X1      (0x1u<<16)
#define IAC_IER3_IAIE111_B_0X0      (0x0u<<15)
#define IAC_IER3_IAIE111_B_0X1      (0x1u<<15)
#define IAC_IER3_IAIE110_B_0X0      (0x0u<<14)
#define IAC_IER3_IAIE110_B_0X1      (0x1u<<14)
#define IAC_IER3_IAIE109_B_0X0      (0x0u<<13)
#define IAC_IER3_IAIE109_B_0X1      (0x1u<<13)
#define IAC_IER3_IAIE108_B_0X0      (0x0u<<12)
#define IAC_IER3_IAIE108_B_0X1      (0x1u<<12)
#define IAC_IER3_IAIE107_B_0X0      (0x0u<<11)
#define IAC_IER3_IAIE107_B_0X1      (0x1u<<11)
#define IAC_IER3_IAIE106_B_0X0      (0x0u<<10)
#define IAC_IER3_IAIE106_B_0X1      (0x1u<<10)
#define IAC_IER3_IAIE105_B_0X0      (0x0u<<9)
#define IAC_IER3_IAIE105_B_0X1      (0x1u<<9)
#define IAC_IER3_IAIE104_B_0X0      (0x0u<<8)
#define IAC_IER3_IAIE104_B_0X1      (0x1u<<8)
#define IAC_IER3_IAIE103_B_0X0      (0x0u<<7)
#define IAC_IER3_IAIE103_B_0X1      (0x1u<<7)
#define IAC_IER3_IAIE102_B_0X0      (0x0u<<6)
#define IAC_IER3_IAIE102_B_0X1      (0x1u<<6)
#define IAC_IER3_IAIE101_B_0X0      (0x0u<<5)
#define IAC_IER3_IAIE101_B_0X1      (0x1u<<5)
#define IAC_IER3_IAIE100_B_0X0      (0x0u<<4)
#define IAC_IER3_IAIE100_B_0X1      (0x1u<<4)
#define IAC_IER3_IAIE99_B_0X0       (0x0u<<3)
#define IAC_IER3_IAIE99_B_0X1       (0x1u<<3)
#define IAC_IER3_IAIE98_B_0X0       (0x0u<<2)
#define IAC_IER3_IAIE98_B_0X1       (0x1u<<2)
#define IAC_IER3_IAIE97_B_0X0       (0x0u<<1)
#define IAC_IER3_IAIE97_B_0X1       (0x1u<<1)
#define IAC_IER3_IAIE96_B_0X0       (0x0u<<0)
#define IAC_IER3_IAIE96_B_0X1       (0x1u<<0)

// IER4 Configuration

#define IAC_IER4_IAIE159            (0x1u<<31)
#define IAC_IER4_IAIE158            (0x1u<<30)
#define IAC_IER4_IAIE157            (0x1u<<29)
#define IAC_IER4_IAIE156            (0x1u<<28)
#define IAC_IER4_IAIE155            (0x1u<<27)
#define IAC_IER4_IAIE154            (0x1u<<26)
#define IAC_IER4_IAIE153            (0x1u<<25)
#define IAC_IER4_IAIE152            (0x1u<<24)
#define IAC_IER4_IAIE151            (0x1u<<23)
#define IAC_IER4_IAIE150            (0x1u<<22)
#define IAC_IER4_IAIE149            (0x1u<<21)
#define IAC_IER4_IAIE148            (0x1u<<20)
#define IAC_IER4_IAIE147            (0x1u<<19)
#define IAC_IER4_IAIE146            (0x1u<<18)
#define IAC_IER4_IAIE145            (0x1u<<17)
#define IAC_IER4_IAIE144            (0x1u<<16)
#define IAC_IER4_IAIE143            (0x1u<<15)
#define IAC_IER4_IAIE142            (0x1u<<14)
#define IAC_IER4_IAIE141            (0x1u<<13)
#define IAC_IER4_IAIE140            (0x1u<<12)
#define IAC_IER4_IAIE139            (0x1u<<11)
#define IAC_IER4_IAIE138            (0x1u<<10)
#define IAC_IER4_IAIE137            (0x1u<<9)
#define IAC_IER4_IAIE136            (0x1u<<8)
#define IAC_IER4_IAIE135            (0x1u<<7)
#define IAC_IER4_IAIE134            (0x1u<<6)
#define IAC_IER4_IAIE133            (0x1u<<5)
#define IAC_IER4_IAIE132            (0x1u<<4)
#define IAC_IER4_IAIE131            (0x1u<<3)
#define IAC_IER4_IAIE130            (0x1u<<2)
#define IAC_IER4_IAIE129            (0x1u<<1)
#define IAC_IER4_IAIE128            (0x1u<<0)

#define IAC_IER4_IAIE159_B_0X0      (0x0u<<31)
#define IAC_IER4_IAIE159_B_0X1      (0x1u<<31)
#define IAC_IER4_IAIE158_B_0X0      (0x0u<<30)
#define IAC_IER4_IAIE158_B_0X1      (0x1u<<30)
#define IAC_IER4_IAIE157_B_0X0      (0x0u<<29)
#define IAC_IER4_IAIE157_B_0X1      (0x1u<<29)
#define IAC_IER4_IAIE156_B_0X0      (0x0u<<28)
#define IAC_IER4_IAIE156_B_0X1      (0x1u<<28)
#define IAC_IER4_IAIE155_B_0X0      (0x0u<<27)
#define IAC_IER4_IAIE155_B_0X1      (0x1u<<27)
#define IAC_IER4_IAIE154_B_0X0      (0x0u<<26)
#define IAC_IER4_IAIE154_B_0X1      (0x1u<<26)
#define IAC_IER4_IAIE153_B_0X0      (0x0u<<25)
#define IAC_IER4_IAIE153_B_0X1      (0x1u<<25)
#define IAC_IER4_IAIE152_B_0X0      (0x0u<<24)
#define IAC_IER4_IAIE152_B_0X1      (0x1u<<24)
#define IAC_IER4_IAIE151_B_0X0      (0x0u<<23)
#define IAC_IER4_IAIE151_B_0X1      (0x1u<<23)
#define IAC_IER4_IAIE150_B_0X0      (0x0u<<22)
#define IAC_IER4_IAIE150_B_0X1      (0x1u<<22)
#define IAC_IER4_IAIE149_B_0X0      (0x0u<<21)
#define IAC_IER4_IAIE149_B_0X1      (0x1u<<21)
#define IAC_IER4_IAIE148_B_0X0      (0x0u<<20)
#define IAC_IER4_IAIE148_B_0X1      (0x1u<<20)
#define IAC_IER4_IAIE147_B_0X0      (0x0u<<19)
#define IAC_IER4_IAIE147_B_0X1      (0x1u<<19)
#define IAC_IER4_IAIE146_B_0X0      (0x0u<<18)
#define IAC_IER4_IAIE146_B_0X1      (0x1u<<18)
#define IAC_IER4_IAIE145_B_0X0      (0x0u<<17)
#define IAC_IER4_IAIE145_B_0X1      (0x1u<<17)
#define IAC_IER4_IAIE144_B_0X0      (0x0u<<16)
#define IAC_IER4_IAIE144_B_0X1      (0x1u<<16)
#define IAC_IER4_IAIE143_B_0X0      (0x0u<<15)
#define IAC_IER4_IAIE143_B_0X1      (0x1u<<15)
#define IAC_IER4_IAIE142_B_0X0      (0x0u<<14)
#define IAC_IER4_IAIE142_B_0X1      (0x1u<<14)
#define IAC_IER4_IAIE141_B_0X0      (0x0u<<13)
#define IAC_IER4_IAIE141_B_0X1      (0x1u<<13)
#define IAC_IER4_IAIE140_B_0X0      (0x0u<<12)
#define IAC_IER4_IAIE140_B_0X1      (0x1u<<12)
#define IAC_IER4_IAIE139_B_0X0      (0x0u<<11)
#define IAC_IER4_IAIE139_B_0X1      (0x1u<<11)
#define IAC_IER4_IAIE138_B_0X0      (0x0u<<10)
#define IAC_IER4_IAIE138_B_0X1      (0x1u<<10)
#define IAC_IER4_IAIE137_B_0X0      (0x0u<<9)
#define IAC_IER4_IAIE137_B_0X1      (0x1u<<9)
#define IAC_IER4_IAIE136_B_0X0      (0x0u<<8)
#define IAC_IER4_IAIE136_B_0X1      (0x1u<<8)
#define IAC_IER4_IAIE135_B_0X0      (0x0u<<7)
#define IAC_IER4_IAIE135_B_0X1      (0x1u<<7)
#define IAC_IER4_IAIE134_B_0X0      (0x0u<<6)
#define IAC_IER4_IAIE134_B_0X1      (0x1u<<6)
#define IAC_IER4_IAIE133_B_0X0      (0x0u<<5)
#define IAC_IER4_IAIE133_B_0X1      (0x1u<<5)
#define IAC_IER4_IAIE132_B_0X0      (0x0u<<4)
#define IAC_IER4_IAIE132_B_0X1      (0x1u<<4)
#define IAC_IER4_IAIE131_B_0X0      (0x0u<<3)
#define IAC_IER4_IAIE131_B_0X1      (0x1u<<3)
#define IAC_IER4_IAIE130_B_0X0      (0x0u<<2)
#define IAC_IER4_IAIE130_B_0X1      (0x1u<<2)
#define IAC_IER4_IAIE129_B_0X0      (0x0u<<1)
#define IAC_IER4_IAIE129_B_0X1      (0x1u<<1)
#define IAC_IER4_IAIE128_B_0X0      (0x0u<<0)
#define IAC_IER4_IAIE128_B_0X1      (0x1u<<0)

// IER5 Configuration

#define IAC_IER5_IAIE191            (0x1u<<31)
#define IAC_IER5_IAIE190            (0x1u<<30)
#define IAC_IER5_IAIE189            (0x1u<<29)
#define IAC_IER5_IAIE188            (0x1u<<28)
#define IAC_IER5_IAIE187            (0x1u<<27)
#define IAC_IER5_IAIE186            (0x1u<<26)
#define IAC_IER5_IAIE185            (0x1u<<25)
#define IAC_IER5_IAIE184            (0x1u<<24)
#define IAC_IER5_IAIE183            (0x1u<<23)
#define IAC_IER5_IAIE182            (0x1u<<22)
#define IAC_IER5_IAIE181            (0x1u<<21)
#define IAC_IER5_IAIE180            (0x1u<<20)
#define IAC_IER5_IAIE179            (0x1u<<19)
#define IAC_IER5_IAIE178            (0x1u<<18)
#define IAC_IER5_IAIE177            (0x1u<<17)
#define IAC_IER5_IAIE176            (0x1u<<16)
#define IAC_IER5_IAIE175            (0x1u<<15)
#define IAC_IER5_IAIE174            (0x1u<<14)
#define IAC_IER5_IAIE173            (0x1u<<13)
#define IAC_IER5_IAIE172            (0x1u<<12)
#define IAC_IER5_IAIE171            (0x1u<<11)
#define IAC_IER5_IAIE170            (0x1u<<10)
#define IAC_IER5_IAIE169            (0x1u<<9)
#define IAC_IER5_IAIE168            (0x1u<<8)
#define IAC_IER5_IAIE167            (0x1u<<7)
#define IAC_IER5_IAIE166            (0x1u<<6)
#define IAC_IER5_IAIE165            (0x1u<<5)
#define IAC_IER5_IAIE164            (0x1u<<4)
#define IAC_IER5_IAIE163            (0x1u<<3)
#define IAC_IER5_IAIE162            (0x1u<<2)
#define IAC_IER5_IAIE161            (0x1u<<1)
#define IAC_IER5_IAIE160            (0x1u<<0)

#define IAC_IER5_IAIE191_B_0X0      (0x0u<<31)
#define IAC_IER5_IAIE191_B_0X1      (0x1u<<31)
#define IAC_IER5_IAIE190_B_0X0      (0x0u<<30)
#define IAC_IER5_IAIE190_B_0X1      (0x1u<<30)
#define IAC_IER5_IAIE189_B_0X0      (0x0u<<29)
#define IAC_IER5_IAIE189_B_0X1      (0x1u<<29)
#define IAC_IER5_IAIE188_B_0X0      (0x0u<<28)
#define IAC_IER5_IAIE188_B_0X1      (0x1u<<28)
#define IAC_IER5_IAIE187_B_0X0      (0x0u<<27)
#define IAC_IER5_IAIE187_B_0X1      (0x1u<<27)
#define IAC_IER5_IAIE186_B_0X0      (0x0u<<26)
#define IAC_IER5_IAIE186_B_0X1      (0x1u<<26)
#define IAC_IER5_IAIE185_B_0X0      (0x0u<<25)
#define IAC_IER5_IAIE185_B_0X1      (0x1u<<25)
#define IAC_IER5_IAIE184_B_0X0      (0x0u<<24)
#define IAC_IER5_IAIE184_B_0X1      (0x1u<<24)
#define IAC_IER5_IAIE183_B_0X0      (0x0u<<23)
#define IAC_IER5_IAIE183_B_0X1      (0x1u<<23)
#define IAC_IER5_IAIE182_B_0X0      (0x0u<<22)
#define IAC_IER5_IAIE182_B_0X1      (0x1u<<22)
#define IAC_IER5_IAIE181_B_0X0      (0x0u<<21)
#define IAC_IER5_IAIE181_B_0X1      (0x1u<<21)
#define IAC_IER5_IAIE180_B_0X0      (0x0u<<20)
#define IAC_IER5_IAIE180_B_0X1      (0x1u<<20)
#define IAC_IER5_IAIE179_B_0X0      (0x0u<<19)
#define IAC_IER5_IAIE179_B_0X1      (0x1u<<19)
#define IAC_IER5_IAIE178_B_0X0      (0x0u<<18)
#define IAC_IER5_IAIE178_B_0X1      (0x1u<<18)
#define IAC_IER5_IAIE177_B_0X0      (0x0u<<17)
#define IAC_IER5_IAIE177_B_0X1      (0x1u<<17)
#define IAC_IER5_IAIE176_B_0X0      (0x0u<<16)
#define IAC_IER5_IAIE176_B_0X1      (0x1u<<16)
#define IAC_IER5_IAIE175_B_0X0      (0x0u<<15)
#define IAC_IER5_IAIE175_B_0X1      (0x1u<<15)
#define IAC_IER5_IAIE174_B_0X0      (0x0u<<14)
#define IAC_IER5_IAIE174_B_0X1      (0x1u<<14)
#define IAC_IER5_IAIE173_B_0X0      (0x0u<<13)
#define IAC_IER5_IAIE173_B_0X1      (0x1u<<13)
#define IAC_IER5_IAIE172_B_0X0      (0x0u<<12)
#define IAC_IER5_IAIE172_B_0X1      (0x1u<<12)
#define IAC_IER5_IAIE171_B_0X0      (0x0u<<11)
#define IAC_IER5_IAIE171_B_0X1      (0x1u<<11)
#define IAC_IER5_IAIE170_B_0X0      (0x0u<<10)
#define IAC_IER5_IAIE170_B_0X1      (0x1u<<10)
#define IAC_IER5_IAIE169_B_0X0      (0x0u<<9)
#define IAC_IER5_IAIE169_B_0X1      (0x1u<<9)
#define IAC_IER5_IAIE168_B_0X0      (0x0u<<8)
#define IAC_IER5_IAIE168_B_0X1      (0x1u<<8)
#define IAC_IER5_IAIE167_B_0X0      (0x0u<<7)
#define IAC_IER5_IAIE167_B_0X1      (0x1u<<7)
#define IAC_IER5_IAIE166_B_0X0      (0x0u<<6)
#define IAC_IER5_IAIE166_B_0X1      (0x1u<<6)
#define IAC_IER5_IAIE165_B_0X0      (0x0u<<5)
#define IAC_IER5_IAIE165_B_0X1      (0x1u<<5)
#define IAC_IER5_IAIE164_B_0X0      (0x0u<<4)
#define IAC_IER5_IAIE164_B_0X1      (0x1u<<4)
#define IAC_IER5_IAIE163_B_0X0      (0x0u<<3)
#define IAC_IER5_IAIE163_B_0X1      (0x1u<<3)
#define IAC_IER5_IAIE162_B_0X0      (0x0u<<2)
#define IAC_IER5_IAIE162_B_0X1      (0x1u<<2)
#define IAC_IER5_IAIE161_B_0X0      (0x0u<<1)
#define IAC_IER5_IAIE161_B_0X1      (0x1u<<1)
#define IAC_IER5_IAIE160_B_0X0      (0x0u<<0)
#define IAC_IER5_IAIE160_B_0X1      (0x1u<<0)

// IER6 Configuration

#define IAC_IER6_IAIE223            (0x1u<<31)
#define IAC_IER6_IAIE222            (0x1u<<30)
#define IAC_IER6_IAIE221            (0x1u<<29)
#define IAC_IER6_IAIE220            (0x1u<<28)
#define IAC_IER6_IAIE219            (0x1u<<27)
#define IAC_IER6_IAIE218            (0x1u<<26)
#define IAC_IER6_IAIE217            (0x1u<<25)
#define IAC_IER6_IAIE216            (0x1u<<24)
#define IAC_IER6_IAIE215            (0x1u<<23)
#define IAC_IER6_IAIE214            (0x1u<<22)
#define IAC_IER6_IAIE213            (0x1u<<21)
#define IAC_IER6_IAIE212            (0x1u<<20)
#define IAC_IER6_IAIE211            (0x1u<<19)
#define IAC_IER6_IAIE210            (0x1u<<18)
#define IAC_IER6_IAIE209            (0x1u<<17)
#define IAC_IER6_IAIE208            (0x1u<<16)
#define IAC_IER6_IAIE207            (0x1u<<15)
#define IAC_IER6_IAIE206            (0x1u<<14)
#define IAC_IER6_IAIE205            (0x1u<<13)
#define IAC_IER6_IAIE204            (0x1u<<12)
#define IAC_IER6_IAIE203            (0x1u<<11)
#define IAC_IER6_IAIE202            (0x1u<<10)
#define IAC_IER6_IAIE201            (0x1u<<9)
#define IAC_IER6_IAIE200            (0x1u<<8)
#define IAC_IER6_IAIE199            (0x1u<<7)
#define IAC_IER6_IAIE198            (0x1u<<6)
#define IAC_IER6_IAIE197            (0x1u<<5)
#define IAC_IER6_IAIE196            (0x1u<<4)
#define IAC_IER6_IAIE195            (0x1u<<3)
#define IAC_IER6_IAIE194            (0x1u<<2)
#define IAC_IER6_IAIE193            (0x1u<<1)
#define IAC_IER6_IAIE192            (0x1u<<0)

#define IAC_IER6_IAIE223_B_0X0      (0x0u<<31)
#define IAC_IER6_IAIE223_B_0X1      (0x1u<<31)
#define IAC_IER6_IAIE222_B_0X0      (0x0u<<30)
#define IAC_IER6_IAIE222_B_0X1      (0x1u<<30)
#define IAC_IER6_IAIE221_B_0X0      (0x0u<<29)
#define IAC_IER6_IAIE221_B_0X1      (0x1u<<29)
#define IAC_IER6_IAIE220_B_0X0      (0x0u<<28)
#define IAC_IER6_IAIE220_B_0X1      (0x1u<<28)
#define IAC_IER6_IAIE219_B_0X0      (0x0u<<27)
#define IAC_IER6_IAIE219_B_0X1      (0x1u<<27)
#define IAC_IER6_IAIE218_B_0X0      (0x0u<<26)
#define IAC_IER6_IAIE218_B_0X1      (0x1u<<26)
#define IAC_IER6_IAIE217_B_0X0      (0x0u<<25)
#define IAC_IER6_IAIE217_B_0X1      (0x1u<<25)
#define IAC_IER6_IAIE216_B_0X0      (0x0u<<24)
#define IAC_IER6_IAIE216_B_0X1      (0x1u<<24)
#define IAC_IER6_IAIE215_B_0X0      (0x0u<<23)
#define IAC_IER6_IAIE215_B_0X1      (0x1u<<23)
#define IAC_IER6_IAIE214_B_0X0      (0x0u<<22)
#define IAC_IER6_IAIE214_B_0X1      (0x1u<<22)
#define IAC_IER6_IAIE213_B_0X0      (0x0u<<21)
#define IAC_IER6_IAIE213_B_0X1      (0x1u<<21)
#define IAC_IER6_IAIE212_B_0X0      (0x0u<<20)
#define IAC_IER6_IAIE212_B_0X1      (0x1u<<20)
#define IAC_IER6_IAIE211_B_0X0      (0x0u<<19)
#define IAC_IER6_IAIE211_B_0X1      (0x1u<<19)
#define IAC_IER6_IAIE210_B_0X0      (0x0u<<18)
#define IAC_IER6_IAIE210_B_0X1      (0x1u<<18)
#define IAC_IER6_IAIE209_B_0X0      (0x0u<<17)
#define IAC_IER6_IAIE209_B_0X1      (0x1u<<17)
#define IAC_IER6_IAIE208_B_0X0      (0x0u<<16)
#define IAC_IER6_IAIE208_B_0X1      (0x1u<<16)
#define IAC_IER6_IAIE207_B_0X0      (0x0u<<15)
#define IAC_IER6_IAIE207_B_0X1      (0x1u<<15)
#define IAC_IER6_IAIE206_B_0X0      (0x0u<<14)
#define IAC_IER6_IAIE206_B_0X1      (0x1u<<14)
#define IAC_IER6_IAIE205_B_0X0      (0x0u<<13)
#define IAC_IER6_IAIE205_B_0X1      (0x1u<<13)
#define IAC_IER6_IAIE204_B_0X0      (0x0u<<12)
#define IAC_IER6_IAIE204_B_0X1      (0x1u<<12)
#define IAC_IER6_IAIE203_B_0X0      (0x0u<<11)
#define IAC_IER6_IAIE203_B_0X1      (0x1u<<11)
#define IAC_IER6_IAIE202_B_0X0      (0x0u<<10)
#define IAC_IER6_IAIE202_B_0X1      (0x1u<<10)
#define IAC_IER6_IAIE201_B_0X0      (0x0u<<9)
#define IAC_IER6_IAIE201_B_0X1      (0x1u<<9)
#define IAC_IER6_IAIE200_B_0X0      (0x0u<<8)
#define IAC_IER6_IAIE200_B_0X1      (0x1u<<8)
#define IAC_IER6_IAIE199_B_0X0      (0x0u<<7)
#define IAC_IER6_IAIE199_B_0X1      (0x1u<<7)
#define IAC_IER6_IAIE198_B_0X0      (0x0u<<6)
#define IAC_IER6_IAIE198_B_0X1      (0x1u<<6)
#define IAC_IER6_IAIE197_B_0X0      (0x0u<<5)
#define IAC_IER6_IAIE197_B_0X1      (0x1u<<5)
#define IAC_IER6_IAIE196_B_0X0      (0x0u<<4)
#define IAC_IER6_IAIE196_B_0X1      (0x1u<<4)
#define IAC_IER6_IAIE195_B_0X0      (0x0u<<3)
#define IAC_IER6_IAIE195_B_0X1      (0x1u<<3)
#define IAC_IER6_IAIE194_B_0X0      (0x0u<<2)
#define IAC_IER6_IAIE194_B_0X1      (0x1u<<2)
#define IAC_IER6_IAIE193_B_0X0      (0x0u<<1)
#define IAC_IER6_IAIE193_B_0X1      (0x1u<<1)
#define IAC_IER6_IAIE192_B_0X0      (0x0u<<0)
#define IAC_IER6_IAIE192_B_0X1      (0x1u<<0)

// IER7 Configuration

#define IAC_IER7_IAIE255            (0x1u<<31)
#define IAC_IER7_IAIE254            (0x1u<<30)
#define IAC_IER7_IAIE253            (0x1u<<29)
#define IAC_IER7_IAIE252            (0x1u<<28)
#define IAC_IER7_IAIE251            (0x1u<<27)
#define IAC_IER7_IAIE250            (0x1u<<26)
#define IAC_IER7_IAIE249            (0x1u<<25)
#define IAC_IER7_IAIE248            (0x1u<<24)
#define IAC_IER7_IAIE247            (0x1u<<23)
#define IAC_IER7_IAIE246            (0x1u<<22)
#define IAC_IER7_IAIE245            (0x1u<<21)
#define IAC_IER7_IAIE244            (0x1u<<20)
#define IAC_IER7_IAIE243            (0x1u<<19)
#define IAC_IER7_IAIE242            (0x1u<<18)
#define IAC_IER7_IAIE241            (0x1u<<17)
#define IAC_IER7_IAIE240            (0x1u<<16)
#define IAC_IER7_IAIE239            (0x1u<<15)
#define IAC_IER7_IAIE238            (0x1u<<14)
#define IAC_IER7_IAIE237            (0x1u<<13)
#define IAC_IER7_IAIE236            (0x1u<<12)
#define IAC_IER7_IAIE235            (0x1u<<11)
#define IAC_IER7_IAIE234            (0x1u<<10)
#define IAC_IER7_IAIE233            (0x1u<<9)
#define IAC_IER7_IAIE232            (0x1u<<8)
#define IAC_IER7_IAIE231            (0x1u<<7)
#define IAC_IER7_IAIE230            (0x1u<<6)
#define IAC_IER7_IAIE229            (0x1u<<5)
#define IAC_IER7_IAIE228            (0x1u<<4)
#define IAC_IER7_IAIE227            (0x1u<<3)
#define IAC_IER7_IAIE226            (0x1u<<2)
#define IAC_IER7_IAIE225            (0x1u<<1)
#define IAC_IER7_IAIE224            (0x1u<<0)

#define IAC_IER7_IAIE255_B_0X0      (0x0u<<31)
#define IAC_IER7_IAIE255_B_0X1      (0x1u<<31)
#define IAC_IER7_IAIE254_B_0X0      (0x0u<<30)
#define IAC_IER7_IAIE254_B_0X1      (0x1u<<30)
#define IAC_IER7_IAIE253_B_0X0      (0x0u<<29)
#define IAC_IER7_IAIE253_B_0X1      (0x1u<<29)
#define IAC_IER7_IAIE252_B_0X0      (0x0u<<28)
#define IAC_IER7_IAIE252_B_0X1      (0x1u<<28)
#define IAC_IER7_IAIE251_B_0X0      (0x0u<<27)
#define IAC_IER7_IAIE251_B_0X1      (0x1u<<27)
#define IAC_IER7_IAIE250_B_0X0      (0x0u<<26)
#define IAC_IER7_IAIE250_B_0X1      (0x1u<<26)
#define IAC_IER7_IAIE249_B_0X0      (0x0u<<25)
#define IAC_IER7_IAIE249_B_0X1      (0x1u<<25)
#define IAC_IER7_IAIE248_B_0X0      (0x0u<<24)
#define IAC_IER7_IAIE248_B_0X1      (0x1u<<24)
#define IAC_IER7_IAIE247_B_0X0      (0x0u<<23)
#define IAC_IER7_IAIE247_B_0X1      (0x1u<<23)
#define IAC_IER7_IAIE246_B_0X0      (0x0u<<22)
#define IAC_IER7_IAIE246_B_0X1      (0x1u<<22)
#define IAC_IER7_IAIE245_B_0X0      (0x0u<<21)
#define IAC_IER7_IAIE245_B_0X1      (0x1u<<21)
#define IAC_IER7_IAIE244_B_0X0      (0x0u<<20)
#define IAC_IER7_IAIE244_B_0X1      (0x1u<<20)
#define IAC_IER7_IAIE243_B_0X0      (0x0u<<19)
#define IAC_IER7_IAIE243_B_0X1      (0x1u<<19)
#define IAC_IER7_IAIE242_B_0X0      (0x0u<<18)
#define IAC_IER7_IAIE242_B_0X1      (0x1u<<18)
#define IAC_IER7_IAIE241_B_0X0      (0x0u<<17)
#define IAC_IER7_IAIE241_B_0X1      (0x1u<<17)
#define IAC_IER7_IAIE240_B_0X0      (0x0u<<16)
#define IAC_IER7_IAIE240_B_0X1      (0x1u<<16)
#define IAC_IER7_IAIE239_B_0X0      (0x0u<<15)
#define IAC_IER7_IAIE239_B_0X1      (0x1u<<15)
#define IAC_IER7_IAIE238_B_0X0      (0x0u<<14)
#define IAC_IER7_IAIE238_B_0X1      (0x1u<<14)
#define IAC_IER7_IAIE237_B_0X0      (0x0u<<13)
#define IAC_IER7_IAIE237_B_0X1      (0x1u<<13)
#define IAC_IER7_IAIE236_B_0X0      (0x0u<<12)
#define IAC_IER7_IAIE236_B_0X1      (0x1u<<12)
#define IAC_IER7_IAIE235_B_0X0      (0x0u<<11)
#define IAC_IER7_IAIE235_B_0X1      (0x1u<<11)
#define IAC_IER7_IAIE234_B_0X0      (0x0u<<10)
#define IAC_IER7_IAIE234_B_0X1      (0x1u<<10)
#define IAC_IER7_IAIE233_B_0X0      (0x0u<<9)
#define IAC_IER7_IAIE233_B_0X1      (0x1u<<9)
#define IAC_IER7_IAIE232_B_0X0      (0x0u<<8)
#define IAC_IER7_IAIE232_B_0X1      (0x1u<<8)
#define IAC_IER7_IAIE231_B_0X0      (0x0u<<7)
#define IAC_IER7_IAIE231_B_0X1      (0x1u<<7)
#define IAC_IER7_IAIE230_B_0X0      (0x0u<<6)
#define IAC_IER7_IAIE230_B_0X1      (0x1u<<6)
#define IAC_IER7_IAIE229_B_0X0      (0x0u<<5)
#define IAC_IER7_IAIE229_B_0X1      (0x1u<<5)
#define IAC_IER7_IAIE228_B_0X0      (0x0u<<4)
#define IAC_IER7_IAIE228_B_0X1      (0x1u<<4)
#define IAC_IER7_IAIE227_B_0X0      (0x0u<<3)
#define IAC_IER7_IAIE227_B_0X1      (0x1u<<3)
#define IAC_IER7_IAIE226_B_0X0      (0x0u<<2)
#define IAC_IER7_IAIE226_B_0X1      (0x1u<<2)
#define IAC_IER7_IAIE225_B_0X0      (0x0u<<1)
#define IAC_IER7_IAIE225_B_0X1      (0x1u<<1)
#define IAC_IER7_IAIE224_B_0X0      (0x0u<<0)
#define IAC_IER7_IAIE224_B_0X1      (0x1u<<0)

// ISR0 Configuration

