Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_ISR0_IAF31              (0x1u<<31)
#define IAC_ISR0_IAF30              (0x1u<<30)
#define IAC_ISR0_IAF29              (0x1u<<29)
#define IAC_ISR0_IAF28              (0x1u<<28)
#define IAC_ISR0_IAF27              (0x1u<<27)
#define IAC_ISR0_IAF26              (0x1u<<26)
#define IAC_ISR0_IAF25              (0x1u<<25)
#define IAC_ISR0_IAF24              (0x1u<<24)
#define IAC_ISR0_IAF23              (0x1u<<23)
#define IAC_ISR0_IAF22              (0x1u<<22)
#define IAC_ISR0_IAF21              (0x1u<<21)
#define IAC_ISR0_IAF20              (0x1u<<20)
#define IAC_ISR0_IAF19              (0x1u<<19)
#define IAC_ISR0_IAF18              (0x1u<<18)
#define IAC_ISR0_IAF17              (0x1u<<17)
#define IAC_ISR0_IAF16              (0x1u<<16)
#define IAC_ISR0_IAF15              (0x1u<<15)
#define IAC_ISR0_IAF14              (0x1u<<14)
#define IAC_ISR0_IAF13              (0x1u<<13)
#define IAC_ISR0_IAF12              (0x1u<<12)
#define IAC_ISR0_IAF11              (0x1u<<11)
#define IAC_ISR0_IAF10              (0x1u<<10)
#define IAC_ISR0_IAF9               (0x1u<<9)
#define IAC_ISR0_IAF8               (0x1u<<8)
#define IAC_ISR0_IAF7               (0x1u<<7)
#define IAC_ISR0_IAF6               (0x1u<<6)
#define IAC_ISR0_IAF5               (0x1u<<5)
#define IAC_ISR0_IAF4               (0x1u<<4)
#define IAC_ISR0_IAF3               (0x1u<<3)
#define IAC_ISR0_IAF2               (0x1u<<2)
#define IAC_ISR0_IAF1               (0x1u<<1)
#define IAC_ISR0_IAF0               (0x1u<<0)

#define IAC_ISR0_IAF31_B_0X0        (0x0u<<31)
#define IAC_ISR0_IAF31_B_0X1        (0x1u<<31)
#define IAC_ISR0_IAF30_B_0X0        (0x0u<<30)
#define IAC_ISR0_IAF30_B_0X1        (0x1u<<30)
#define IAC_ISR0_IAF29_B_0X0        (0x0u<<29)
#define IAC_ISR0_IAF29_B_0X1        (0x1u<<29)
#define IAC_ISR0_IAF28_B_0X0        (0x0u<<28)
#define IAC_ISR0_IAF28_B_0X1        (0x1u<<28)
#define IAC_ISR0_IAF27_B_0X0        (0x0u<<27)
#define IAC_ISR0_IAF27_B_0X1        (0x1u<<27)
#define IAC_ISR0_IAF26_B_0X0        (0x0u<<26)
#define IAC_ISR0_IAF26_B_0X1        (0x1u<<26)
#define IAC_ISR0_IAF25_B_0X0        (0x0u<<25)
#define IAC_ISR0_IAF25_B_0X1        (0x1u<<25)
#define IAC_ISR0_IAF24_B_0X0        (0x0u<<24)
#define IAC_ISR0_IAF24_B_0X1        (0x1u<<24)
#define IAC_ISR0_IAF23_B_0X0        (0x0u<<23)
#define IAC_ISR0_IAF23_B_0X1        (0x1u<<23)
#define IAC_ISR0_IAF22_B_0X0        (0x0u<<22)
#define IAC_ISR0_IAF22_B_0X1        (0x1u<<22)
#define IAC_ISR0_IAF21_B_0X0        (0x0u<<21)
#define IAC_ISR0_IAF21_B_0X1        (0x1u<<21)
#define IAC_ISR0_IAF20_B_0X0        (0x0u<<20)
#define IAC_ISR0_IAF20_B_0X1        (0x1u<<20)
#define IAC_ISR0_IAF19_B_0X0        (0x0u<<19)
#define IAC_ISR0_IAF19_B_0X1        (0x1u<<19)
#define IAC_ISR0_IAF18_B_0X0        (0x0u<<18)
#define IAC_ISR0_IAF18_B_0X1        (0x1u<<18)
#define IAC_ISR0_IAF17_B_0X0        (0x0u<<17)
#define IAC_ISR0_IAF17_B_0X1        (0x1u<<17)
#define IAC_ISR0_IAF16_B_0X0        (0x0u<<16)
#define IAC_ISR0_IAF16_B_0X1        (0x1u<<16)
#define IAC_ISR0_IAF15_B_0X0        (0x0u<<15)
#define IAC_ISR0_IAF15_B_0X1        (0x1u<<15)
#define IAC_ISR0_IAF14_B_0X0        (0x0u<<14)
#define IAC_ISR0_IAF14_B_0X1        (0x1u<<14)
#define IAC_ISR0_IAF13_B_0X0        (0x0u<<13)
#define IAC_ISR0_IAF13_B_0X1        (0x1u<<13)
#define IAC_ISR0_IAF12_B_0X0        (0x0u<<12)
#define IAC_ISR0_IAF12_B_0X1        (0x1u<<12)
#define IAC_ISR0_IAF11_B_0X0        (0x0u<<11)
#define IAC_ISR0_IAF11_B_0X1        (0x1u<<11)
#define IAC_ISR0_IAF10_B_0X0        (0x0u<<10)
#define IAC_ISR0_IAF10_B_0X1        (0x1u<<10)
#define IAC_ISR0_IAF9_B_0X0         (0x0u<<9)
#define IAC_ISR0_IAF9_B_0X1         (0x1u<<9)
#define IAC_ISR0_IAF8_B_0X0         (0x0u<<8)
#define IAC_ISR0_IAF8_B_0X1         (0x1u<<8)
#define IAC_ISR0_IAF7_B_0X0         (0x0u<<7)
#define IAC_ISR0_IAF7_B_0X1         (0x1u<<7)
#define IAC_ISR0_IAF6_B_0X0         (0x0u<<6)
#define IAC_ISR0_IAF6_B_0X1         (0x1u<<6)
#define IAC_ISR0_IAF5_B_0X0         (0x0u<<5)
#define IAC_ISR0_IAF5_B_0X1         (0x1u<<5)
#define IAC_ISR0_IAF4_B_0X0         (0x0u<<4)
#define IAC_ISR0_IAF4_B_0X1         (0x1u<<4)
#define IAC_ISR0_IAF3_B_0X0         (0x0u<<3)
#define IAC_ISR0_IAF3_B_0X1         (0x1u<<3)
#define IAC_ISR0_IAF2_B_0X0         (0x0u<<2)
#define IAC_ISR0_IAF2_B_0X1         (0x1u<<2)
#define IAC_ISR0_IAF1_B_0X0         (0x0u<<1)
#define IAC_ISR0_IAF1_B_0X1         (0x1u<<1)
#define IAC_ISR0_IAF0_B_0X0         (0x0u<<0)
#define IAC_ISR0_IAF0_B_0X1         (0x1u<<0)

// ISR1 Configuration

#define IAC_ISR1_IAF63              (0x1u<<31)
#define IAC_ISR1_IAF62              (0x1u<<30)
#define IAC_ISR1_IAF61              (0x1u<<29)
#define IAC_ISR1_IAF60              (0x1u<<28)
#define IAC_ISR1_IAF59              (0x1u<<27)
#define IAC_ISR1_IAF58              (0x1u<<26)
#define IAC_ISR1_IAF57              (0x1u<<25)
#define IAC_ISR1_IAF56              (0x1u<<24)
#define IAC_ISR1_IAF55              (0x1u<<23)
#define IAC_ISR1_IAF54              (0x1u<<22)
#define IAC_ISR1_IAF53              (0x1u<<21)
#define IAC_ISR1_IAF52              (0x1u<<20)
#define IAC_ISR1_IAF51              (0x1u<<19)
#define IAC_ISR1_IAF50              (0x1u<<18)
#define IAC_ISR1_IAF49              (0x1u<<17)
#define IAC_ISR1_IAF48              (0x1u<<16)
#define IAC_ISR1_IAF47              (0x1u<<15)
#define IAC_ISR1_IAF46              (0x1u<<14)
#define IAC_ISR1_IAF45              (0x1u<<13)
#define IAC_ISR1_IAF44              (0x1u<<12)
#define IAC_ISR1_IAF43              (0x1u<<11)
#define IAC_ISR1_IAF42              (0x1u<<10)
#define IAC_ISR1_IAF41              (0x1u<<9)
#define IAC_ISR1_IAF40              (0x1u<<8)
#define IAC_ISR1_IAF39              (0x1u<<7)
#define IAC_ISR1_IAF38              (0x1u<<6)
#define IAC_ISR1_IAF37              (0x1u<<5)
#define IAC_ISR1_IAF36              (0x1u<<4)
#define IAC_ISR1_IAF35              (0x1u<<3)
#define IAC_ISR1_IAF34              (0x1u<<2)
#define IAC_ISR1_IAF33              (0x1u<<1)
#define IAC_ISR1_IAF32              (0x1u<<0)

#define IAC_ISR1_IAF63_B_0X0        (0x0u<<31)
#define IAC_ISR1_IAF63_B_0X1        (0x1u<<31)
#define IAC_ISR1_IAF62_B_0X0        (0x0u<<30)
#define IAC_ISR1_IAF62_B_0X1        (0x1u<<30)
#define IAC_ISR1_IAF61_B_0X0        (0x0u<<29)
#define IAC_ISR1_IAF61_B_0X1        (0x1u<<29)
#define IAC_ISR1_IAF60_B_0X0        (0x0u<<28)
#define IAC_ISR1_IAF60_B_0X1        (0x1u<<28)
#define IAC_ISR1_IAF59_B_0X0        (0x0u<<27)
#define IAC_ISR1_IAF59_B_0X1        (0x1u<<27)
#define IAC_ISR1_IAF58_B_0X0        (0x0u<<26)
#define IAC_ISR1_IAF58_B_0X1        (0x1u<<26)
#define IAC_ISR1_IAF57_B_0X0        (0x0u<<25)
#define IAC_ISR1_IAF57_B_0X1        (0x1u<<25)
#define IAC_ISR1_IAF56_B_0X0        (0x0u<<24)
#define IAC_ISR1_IAF56_B_0X1        (0x1u<<24)
#define IAC_ISR1_IAF55_B_0X0        (0x0u<<23)
#define IAC_ISR1_IAF55_B_0X1        (0x1u<<23)
#define IAC_ISR1_IAF54_B_0X0        (0x0u<<22)
#define IAC_ISR1_IAF54_B_0X1        (0x1u<<22)
#define IAC_ISR1_IAF53_B_0X0        (0x0u<<21)
#define IAC_ISR1_IAF53_B_0X1        (0x1u<<21)
#define IAC_ISR1_IAF52_B_0X0        (0x0u<<20)
#define IAC_ISR1_IAF52_B_0X1        (0x1u<<20)
#define IAC_ISR1_IAF51_B_0X0        (0x0u<<19)
#define IAC_ISR1_IAF51_B_0X1        (0x1u<<19)
#define IAC_ISR1_IAF50_B_0X0        (0x0u<<18)
#define IAC_ISR1_IAF50_B_0X1        (0x1u<<18)
#define IAC_ISR1_IAF49_B_0X0        (0x0u<<17)
#define IAC_ISR1_IAF49_B_0X1        (0x1u<<17)
#define IAC_ISR1_IAF48_B_0X0        (0x0u<<16)
#define IAC_ISR1_IAF48_B_0X1        (0x1u<<16)
#define IAC_ISR1_IAF47_B_0X0        (0x0u<<15)
#define IAC_ISR1_IAF47_B_0X1        (0x1u<<15)
#define IAC_ISR1_IAF46_B_0X0        (0x0u<<14)
#define IAC_ISR1_IAF46_B_0X1        (0x1u<<14)
#define IAC_ISR1_IAF45_B_0X0        (0x0u<<13)
#define IAC_ISR1_IAF45_B_0X1        (0x1u<<13)
#define IAC_ISR1_IAF44_B_0X0        (0x0u<<12)
#define IAC_ISR1_IAF44_B_0X1        (0x1u<<12)
#define IAC_ISR1_IAF43_B_0X0        (0x0u<<11)
#define IAC_ISR1_IAF43_B_0X1        (0x1u<<11)
#define IAC_ISR1_IAF42_B_0X0        (0x0u<<10)
#define IAC_ISR1_IAF42_B_0X1        (0x1u<<10)
#define IAC_ISR1_IAF41_B_0X0        (0x0u<<9)
#define IAC_ISR1_IAF41_B_0X1        (0x1u<<9)
#define IAC_ISR1_IAF40_B_0X0        (0x0u<<8)
#define IAC_ISR1_IAF40_B_0X1        (0x1u<<8)
#define IAC_ISR1_IAF39_B_0X0        (0x0u<<7)
#define IAC_ISR1_IAF39_B_0X1        (0x1u<<7)
#define IAC_ISR1_IAF38_B_0X0        (0x0u<<6)
#define IAC_ISR1_IAF38_B_0X1        (0x1u<<6)
#define IAC_ISR1_IAF37_B_0X0        (0x0u<<5)
#define IAC_ISR1_IAF37_B_0X1        (0x1u<<5)
#define IAC_ISR1_IAF36_B_0X0        (0x0u<<4)
#define IAC_ISR1_IAF36_B_0X1        (0x1u<<4)
#define IAC_ISR1_IAF35_B_0X0        (0x0u<<3)
#define IAC_ISR1_IAF35_B_0X1        (0x1u<<3)
#define IAC_ISR1_IAF34_B_0X0        (0x0u<<2)
#define IAC_ISR1_IAF34_B_0X1        (0x1u<<2)
#define IAC_ISR1_IAF33_B_0X0        (0x0u<<1)
#define IAC_ISR1_IAF33_B_0X1        (0x1u<<1)
#define IAC_ISR1_IAF32_B_0X0        (0x0u<<0)
#define IAC_ISR1_IAF32_B_0X1        (0x1u<<0)

