Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
// ISR2 Configuration

#define IAC_ISR2_IAF95              (0x1u<<31)
#define IAC_ISR2_IAF94              (0x1u<<30)
#define IAC_ISR2_IAF93              (0x1u<<29)
#define IAC_ISR2_IAF92              (0x1u<<28)
#define IAC_ISR2_IAF91              (0x1u<<27)
#define IAC_ISR2_IAF90              (0x1u<<26)
#define IAC_ISR2_IAF89              (0x1u<<25)
#define IAC_ISR2_IAF88              (0x1u<<24)
#define IAC_ISR2_IAF87              (0x1u<<23)
#define IAC_ISR2_IAF86              (0x1u<<22)
#define IAC_ISR2_IAF85              (0x1u<<21)
#define IAC_ISR2_IAF84              (0x1u<<20)
#define IAC_ISR2_IAF83              (0x1u<<19)
#define IAC_ISR2_IAF82              (0x1u<<18)
#define IAC_ISR2_IAF81              (0x1u<<17)
#define IAC_ISR2_IAF80              (0x1u<<16)
#define IAC_ISR2_IAF79              (0x1u<<15)
#define IAC_ISR2_IAF78              (0x1u<<14)
#define IAC_ISR2_IAF77              (0x1u<<13)
#define IAC_ISR2_IAF76              (0x1u<<12)
#define IAC_ISR2_IAF75              (0x1u<<11)
#define IAC_ISR2_IAF74              (0x1u<<10)
#define IAC_ISR2_IAF73              (0x1u<<9)
#define IAC_ISR2_IAF72              (0x1u<<8)
#define IAC_ISR2_IAF71              (0x1u<<7)
#define IAC_ISR2_IAF70              (0x1u<<6)
#define IAC_ISR2_IAF69              (0x1u<<5)
#define IAC_ISR2_IAF68              (0x1u<<4)
#define IAC_ISR2_IAF67              (0x1u<<3)
#define IAC_ISR2_IAF66              (0x1u<<2)
#define IAC_ISR2_IAF65              (0x1u<<1)
#define IAC_ISR2_IAF64              (0x1u<<0)

#define IAC_ISR2_IAF95_B_0X0        (0x0u<<31)
#define IAC_ISR2_IAF95_B_0X1        (0x1u<<31)
#define IAC_ISR2_IAF94_B_0X0        (0x0u<<30)
#define IAC_ISR2_IAF94_B_0X1        (0x1u<<30)
#define IAC_ISR2_IAF93_B_0X0        (0x0u<<29)
#define IAC_ISR2_IAF93_B_0X1        (0x1u<<29)
#define IAC_ISR2_IAF92_B_0X0        (0x0u<<28)
#define IAC_ISR2_IAF92_B_0X1        (0x1u<<28)
#define IAC_ISR2_IAF91_B_0X0        (0x0u<<27)
#define IAC_ISR2_IAF91_B_0X1        (0x1u<<27)
#define IAC_ISR2_IAF90_B_0X0        (0x0u<<26)
#define IAC_ISR2_IAF90_B_0X1        (0x1u<<26)
#define IAC_ISR2_IAF89_B_0X0        (0x0u<<25)
#define IAC_ISR2_IAF89_B_0X1        (0x1u<<25)
#define IAC_ISR2_IAF88_B_0X0        (0x0u<<24)
#define IAC_ISR2_IAF88_B_0X1        (0x1u<<24)
#define IAC_ISR2_IAF87_B_0X0        (0x0u<<23)
#define IAC_ISR2_IAF87_B_0X1        (0x1u<<23)
#define IAC_ISR2_IAF86_B_0X0        (0x0u<<22)
#define IAC_ISR2_IAF86_B_0X1        (0x1u<<22)
#define IAC_ISR2_IAF85_B_0X0        (0x0u<<21)
#define IAC_ISR2_IAF85_B_0X1        (0x1u<<21)
#define IAC_ISR2_IAF84_B_0X0        (0x0u<<20)
#define IAC_ISR2_IAF84_B_0X1        (0x1u<<20)
#define IAC_ISR2_IAF83_B_0X0        (0x0u<<19)
#define IAC_ISR2_IAF83_B_0X1        (0x1u<<19)
#define IAC_ISR2_IAF82_B_0X0        (0x0u<<18)
#define IAC_ISR2_IAF82_B_0X1        (0x1u<<18)
#define IAC_ISR2_IAF81_B_0X0        (0x0u<<17)
#define IAC_ISR2_IAF81_B_0X1        (0x1u<<17)
#define IAC_ISR2_IAF80_B_0X0        (0x0u<<16)
#define IAC_ISR2_IAF80_B_0X1        (0x1u<<16)
#define IAC_ISR2_IAF79_B_0X0        (0x0u<<15)
#define IAC_ISR2_IAF79_B_0X1        (0x1u<<15)
#define IAC_ISR2_IAF78_B_0X0        (0x0u<<14)
#define IAC_ISR2_IAF78_B_0X1        (0x1u<<14)
#define IAC_ISR2_IAF77_B_0X0        (0x0u<<13)
#define IAC_ISR2_IAF77_B_0X1        (0x1u<<13)
#define IAC_ISR2_IAF76_B_0X0        (0x0u<<12)
#define IAC_ISR2_IAF76_B_0X1        (0x1u<<12)
#define IAC_ISR2_IAF75_B_0X0        (0x0u<<11)
#define IAC_ISR2_IAF75_B_0X1        (0x1u<<11)
#define IAC_ISR2_IAF74_B_0X0        (0x0u<<10)
#define IAC_ISR2_IAF74_B_0X1        (0x1u<<10)
#define IAC_ISR2_IAF73_B_0X0        (0x0u<<9)
#define IAC_ISR2_IAF73_B_0X1        (0x1u<<9)
#define IAC_ISR2_IAF72_B_0X0        (0x0u<<8)
#define IAC_ISR2_IAF72_B_0X1        (0x1u<<8)
#define IAC_ISR2_IAF71_B_0X0        (0x0u<<7)
#define IAC_ISR2_IAF71_B_0X1        (0x1u<<7)
#define IAC_ISR2_IAF70_B_0X0        (0x0u<<6)
#define IAC_ISR2_IAF70_B_0X1        (0x1u<<6)
#define IAC_ISR2_IAF69_B_0X0        (0x0u<<5)
#define IAC_ISR2_IAF69_B_0X1        (0x1u<<5)
#define IAC_ISR2_IAF68_B_0X0        (0x0u<<4)
#define IAC_ISR2_IAF68_B_0X1        (0x1u<<4)
#define IAC_ISR2_IAF67_B_0X0        (0x0u<<3)
#define IAC_ISR2_IAF67_B_0X1        (0x1u<<3)
#define IAC_ISR2_IAF66_B_0X0        (0x0u<<2)
#define IAC_ISR2_IAF66_B_0X1        (0x1u<<2)
#define IAC_ISR2_IAF65_B_0X0        (0x0u<<1)
#define IAC_ISR2_IAF65_B_0X1        (0x1u<<1)
#define IAC_ISR2_IAF64_B_0X0        (0x0u<<0)
#define IAC_ISR2_IAF64_B_0X1        (0x1u<<0)

// ISR3 Configuration

#define IAC_ISR3_IAF127             (0x1u<<31)
#define IAC_ISR3_IAF126             (0x1u<<30)
#define IAC_ISR3_IAF125             (0x1u<<29)
#define IAC_ISR3_IAF124             (0x1u<<28)
#define IAC_ISR3_IAF123             (0x1u<<27)
#define IAC_ISR3_IAF122             (0x1u<<26)
#define IAC_ISR3_IAF121             (0x1u<<25)
#define IAC_ISR3_IAF120             (0x1u<<24)
#define IAC_ISR3_IAF119             (0x1u<<23)
#define IAC_ISR3_IAF118             (0x1u<<22)
#define IAC_ISR3_IAF117             (0x1u<<21)
#define IAC_ISR3_IAF116             (0x1u<<20)
#define IAC_ISR3_IAF115             (0x1u<<19)
#define IAC_ISR3_IAF114             (0x1u<<18)
#define IAC_ISR3_IAF113             (0x1u<<17)
#define IAC_ISR3_IAF112             (0x1u<<16)
#define IAC_ISR3_IAF111             (0x1u<<15)
#define IAC_ISR3_IAF110             (0x1u<<14)
#define IAC_ISR3_IAF109             (0x1u<<13)
#define IAC_ISR3_IAF108             (0x1u<<12)
#define IAC_ISR3_IAF107             (0x1u<<11)
#define IAC_ISR3_IAF106             (0x1u<<10)
#define IAC_ISR3_IAF105             (0x1u<<9)
#define IAC_ISR3_IAF104             (0x1u<<8)
#define IAC_ISR3_IAF103             (0x1u<<7)
#define IAC_ISR3_IAF102             (0x1u<<6)
#define IAC_ISR3_IAF101             (0x1u<<5)
#define IAC_ISR3_IAF100             (0x1u<<4)
#define IAC_ISR3_IAF99              (0x1u<<3)
#define IAC_ISR3_IAF98              (0x1u<<2)
#define IAC_ISR3_IAF97              (0x1u<<1)
#define IAC_ISR3_IAF96              (0x1u<<0)

