Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_ISR3_IAF127_B_0X0       (0x0u<<31)
#define IAC_ISR3_IAF127_B_0X1       (0x1u<<31)
#define IAC_ISR3_IAF126_B_0X0       (0x0u<<30)
#define IAC_ISR3_IAF126_B_0X1       (0x1u<<30)
#define IAC_ISR3_IAF125_B_0X0       (0x0u<<29)
#define IAC_ISR3_IAF125_B_0X1       (0x1u<<29)
#define IAC_ISR3_IAF124_B_0X0       (0x0u<<28)
#define IAC_ISR3_IAF124_B_0X1       (0x1u<<28)
#define IAC_ISR3_IAF123_B_0X0       (0x0u<<27)
#define IAC_ISR3_IAF123_B_0X1       (0x1u<<27)
#define IAC_ISR3_IAF122_B_0X0       (0x0u<<26)
#define IAC_ISR3_IAF122_B_0X1       (0x1u<<26)
#define IAC_ISR3_IAF121_B_0X0       (0x0u<<25)
#define IAC_ISR3_IAF121_B_0X1       (0x1u<<25)
#define IAC_ISR3_IAF120_B_0X0       (0x0u<<24)
#define IAC_ISR3_IAF120_B_0X1       (0x1u<<24)
#define IAC_ISR3_IAF119_B_0X0       (0x0u<<23)
#define IAC_ISR3_IAF119_B_0X1       (0x1u<<23)
#define IAC_ISR3_IAF118_B_0X0       (0x0u<<22)
#define IAC_ISR3_IAF118_B_0X1       (0x1u<<22)
#define IAC_ISR3_IAF117_B_0X0       (0x0u<<21)
#define IAC_ISR3_IAF117_B_0X1       (0x1u<<21)
#define IAC_ISR3_IAF116_B_0X0       (0x0u<<20)
#define IAC_ISR3_IAF116_B_0X1       (0x1u<<20)
#define IAC_ISR3_IAF115_B_0X0       (0x0u<<19)
#define IAC_ISR3_IAF115_B_0X1       (0x1u<<19)
#define IAC_ISR3_IAF114_B_0X0       (0x0u<<18)
#define IAC_ISR3_IAF114_B_0X1       (0x1u<<18)
#define IAC_ISR3_IAF113_B_0X0       (0x0u<<17)
#define IAC_ISR3_IAF113_B_0X1       (0x1u<<17)
#define IAC_ISR3_IAF112_B_0X0       (0x0u<<16)
#define IAC_ISR3_IAF112_B_0X1       (0x1u<<16)
#define IAC_ISR3_IAF111_B_0X0       (0x0u<<15)
#define IAC_ISR3_IAF111_B_0X1       (0x1u<<15)
#define IAC_ISR3_IAF110_B_0X0       (0x0u<<14)
#define IAC_ISR3_IAF110_B_0X1       (0x1u<<14)
#define IAC_ISR3_IAF109_B_0X0       (0x0u<<13)
#define IAC_ISR3_IAF109_B_0X1       (0x1u<<13)
#define IAC_ISR3_IAF108_B_0X0       (0x0u<<12)
#define IAC_ISR3_IAF108_B_0X1       (0x1u<<12)
#define IAC_ISR3_IAF107_B_0X0       (0x0u<<11)
#define IAC_ISR3_IAF107_B_0X1       (0x1u<<11)
#define IAC_ISR3_IAF106_B_0X0       (0x0u<<10)
#define IAC_ISR3_IAF106_B_0X1       (0x1u<<10)
#define IAC_ISR3_IAF105_B_0X0       (0x0u<<9)
#define IAC_ISR3_IAF105_B_0X1       (0x1u<<9)
#define IAC_ISR3_IAF104_B_0X0       (0x0u<<8)
#define IAC_ISR3_IAF104_B_0X1       (0x1u<<8)
#define IAC_ISR3_IAF103_B_0X0       (0x0u<<7)
#define IAC_ISR3_IAF103_B_0X1       (0x1u<<7)
#define IAC_ISR3_IAF102_B_0X0       (0x0u<<6)
#define IAC_ISR3_IAF102_B_0X1       (0x1u<<6)
#define IAC_ISR3_IAF101_B_0X0       (0x0u<<5)
#define IAC_ISR3_IAF101_B_0X1       (0x1u<<5)
#define IAC_ISR3_IAF100_B_0X0       (0x0u<<4)
#define IAC_ISR3_IAF100_B_0X1       (0x1u<<4)
#define IAC_ISR3_IAF99_B_0X0        (0x0u<<3)
#define IAC_ISR3_IAF99_B_0X1        (0x1u<<3)
#define IAC_ISR3_IAF98_B_0X0        (0x0u<<2)
#define IAC_ISR3_IAF98_B_0X1        (0x1u<<2)
#define IAC_ISR3_IAF97_B_0X0        (0x0u<<1)
#define IAC_ISR3_IAF97_B_0X1        (0x1u<<1)
#define IAC_ISR3_IAF96_B_0X0        (0x0u<<0)
#define IAC_ISR3_IAF96_B_0X1        (0x1u<<0)

// ISR4 Configuration

#define IAC_ISR4_IAF159             (0x1u<<31)
#define IAC_ISR4_IAF158             (0x1u<<30)
#define IAC_ISR4_IAF157             (0x1u<<29)
#define IAC_ISR4_IAF156             (0x1u<<28)
#define IAC_ISR4_IAF155             (0x1u<<27)
#define IAC_ISR4_IAF154             (0x1u<<26)
#define IAC_ISR4_IAF153             (0x1u<<25)
#define IAC_ISR4_IAF152             (0x1u<<24)
#define IAC_ISR4_IAF151             (0x1u<<23)
#define IAC_ISR4_IAF150             (0x1u<<22)
#define IAC_ISR4_IAF149             (0x1u<<21)
#define IAC_ISR4_IAF148             (0x1u<<20)
#define IAC_ISR4_IAF147             (0x1u<<19)
#define IAC_ISR4_IAF146             (0x1u<<18)
#define IAC_ISR4_IAF145             (0x1u<<17)
#define IAC_ISR4_IAF144             (0x1u<<16)
#define IAC_ISR4_IAF143             (0x1u<<15)
#define IAC_ISR4_IAF142             (0x1u<<14)
#define IAC_ISR4_IAF141             (0x1u<<13)
#define IAC_ISR4_IAF140             (0x1u<<12)
#define IAC_ISR4_IAF139             (0x1u<<11)
#define IAC_ISR4_IAF138             (0x1u<<10)
#define IAC_ISR4_IAF137             (0x1u<<9)
#define IAC_ISR4_IAF136             (0x1u<<8)
#define IAC_ISR4_IAF135             (0x1u<<7)
#define IAC_ISR4_IAF134             (0x1u<<6)
#define IAC_ISR4_IAF133             (0x1u<<5)
#define IAC_ISR4_IAF132             (0x1u<<4)
#define IAC_ISR4_IAF131             (0x1u<<3)
#define IAC_ISR4_IAF130             (0x1u<<2)
#define IAC_ISR4_IAF129             (0x1u<<1)
#define IAC_ISR4_IAF128             (0x1u<<0)

#define IAC_ISR4_IAF159_B_0X0       (0x0u<<31)
#define IAC_ISR4_IAF159_B_0X1       (0x1u<<31)
#define IAC_ISR4_IAF158_B_0X0       (0x0u<<30)
#define IAC_ISR4_IAF158_B_0X1       (0x1u<<30)
#define IAC_ISR4_IAF157_B_0X0       (0x0u<<29)
#define IAC_ISR4_IAF157_B_0X1       (0x1u<<29)
#define IAC_ISR4_IAF156_B_0X0       (0x0u<<28)
#define IAC_ISR4_IAF156_B_0X1       (0x1u<<28)
#define IAC_ISR4_IAF155_B_0X0       (0x0u<<27)
#define IAC_ISR4_IAF155_B_0X1       (0x1u<<27)
#define IAC_ISR4_IAF154_B_0X0       (0x0u<<26)
#define IAC_ISR4_IAF154_B_0X1       (0x1u<<26)
#define IAC_ISR4_IAF153_B_0X0       (0x0u<<25)
#define IAC_ISR4_IAF153_B_0X1       (0x1u<<25)
#define IAC_ISR4_IAF152_B_0X0       (0x0u<<24)
#define IAC_ISR4_IAF152_B_0X1       (0x1u<<24)
#define IAC_ISR4_IAF151_B_0X0       (0x0u<<23)
#define IAC_ISR4_IAF151_B_0X1       (0x1u<<23)
#define IAC_ISR4_IAF150_B_0X0       (0x0u<<22)
#define IAC_ISR4_IAF150_B_0X1       (0x1u<<22)
#define IAC_ISR4_IAF149_B_0X0       (0x0u<<21)
#define IAC_ISR4_IAF149_B_0X1       (0x1u<<21)
#define IAC_ISR4_IAF148_B_0X0       (0x0u<<20)
#define IAC_ISR4_IAF148_B_0X1       (0x1u<<20)
#define IAC_ISR4_IAF147_B_0X0       (0x0u<<19)
#define IAC_ISR4_IAF147_B_0X1       (0x1u<<19)
#define IAC_ISR4_IAF146_B_0X0       (0x0u<<18)
#define IAC_ISR4_IAF146_B_0X1       (0x1u<<18)
#define IAC_ISR4_IAF145_B_0X0       (0x0u<<17)
#define IAC_ISR4_IAF145_B_0X1       (0x1u<<17)
#define IAC_ISR4_IAF144_B_0X0       (0x0u<<16)
#define IAC_ISR4_IAF144_B_0X1       (0x1u<<16)
#define IAC_ISR4_IAF143_B_0X0       (0x0u<<15)
#define IAC_ISR4_IAF143_B_0X1       (0x1u<<15)
#define IAC_ISR4_IAF142_B_0X0       (0x0u<<14)
#define IAC_ISR4_IAF142_B_0X1       (0x1u<<14)
#define IAC_ISR4_IAF141_B_0X0       (0x0u<<13)
#define IAC_ISR4_IAF141_B_0X1       (0x1u<<13)
#define IAC_ISR4_IAF140_B_0X0       (0x0u<<12)
#define IAC_ISR4_IAF140_B_0X1       (0x1u<<12)
#define IAC_ISR4_IAF139_B_0X0       (0x0u<<11)
#define IAC_ISR4_IAF139_B_0X1       (0x1u<<11)
#define IAC_ISR4_IAF138_B_0X0       (0x0u<<10)
#define IAC_ISR4_IAF138_B_0X1       (0x1u<<10)
#define IAC_ISR4_IAF137_B_0X0       (0x0u<<9)
#define IAC_ISR4_IAF137_B_0X1       (0x1u<<9)
#define IAC_ISR4_IAF136_B_0X0       (0x0u<<8)
#define IAC_ISR4_IAF136_B_0X1       (0x1u<<8)
#define IAC_ISR4_IAF135_B_0X0       (0x0u<<7)
#define IAC_ISR4_IAF135_B_0X1       (0x1u<<7)
#define IAC_ISR4_IAF134_B_0X0       (0x0u<<6)
#define IAC_ISR4_IAF134_B_0X1       (0x1u<<6)
#define IAC_ISR4_IAF133_B_0X0       (0x0u<<5)
#define IAC_ISR4_IAF133_B_0X1       (0x1u<<5)
#define IAC_ISR4_IAF132_B_0X0       (0x0u<<4)
#define IAC_ISR4_IAF132_B_0X1       (0x1u<<4)
#define IAC_ISR4_IAF131_B_0X0       (0x0u<<3)
#define IAC_ISR4_IAF131_B_0X1       (0x1u<<3)
#define IAC_ISR4_IAF130_B_0X0       (0x0u<<2)
#define IAC_ISR4_IAF130_B_0X1       (0x1u<<2)
#define IAC_ISR4_IAF129_B_0X0       (0x0u<<1)
#define IAC_ISR4_IAF129_B_0X1       (0x1u<<1)
#define IAC_ISR4_IAF128_B_0X0       (0x0u<<0)
#define IAC_ISR4_IAF128_B_0X1       (0x1u<<0)

// ISR5 Configuration

#define IAC_ISR5_IAF191             (0x1u<<31)
#define IAC_ISR5_IAF190             (0x1u<<30)
#define IAC_ISR5_IAF189             (0x1u<<29)
#define IAC_ISR5_IAF188             (0x1u<<28)
#define IAC_ISR5_IAF187             (0x1u<<27)
#define IAC_ISR5_IAF186             (0x1u<<26)
#define IAC_ISR5_IAF185             (0x1u<<25)
#define IAC_ISR5_IAF184             (0x1u<<24)
#define IAC_ISR5_IAF183             (0x1u<<23)
#define IAC_ISR5_IAF182             (0x1u<<22)
#define IAC_ISR5_IAF181             (0x1u<<21)
#define IAC_ISR5_IAF180             (0x1u<<20)
#define IAC_ISR5_IAF179             (0x1u<<19)
#define IAC_ISR5_IAF178             (0x1u<<18)
#define IAC_ISR5_IAF177             (0x1u<<17)
#define IAC_ISR5_IAF176             (0x1u<<16)
#define IAC_ISR5_IAF175             (0x1u<<15)
#define IAC_ISR5_IAF174             (0x1u<<14)
#define IAC_ISR5_IAF173             (0x1u<<13)
#define IAC_ISR5_IAF172             (0x1u<<12)
#define IAC_ISR5_IAF171             (0x1u<<11)
#define IAC_ISR5_IAF170             (0x1u<<10)
#define IAC_ISR5_IAF169             (0x1u<<9)
#define IAC_ISR5_IAF168             (0x1u<<8)
#define IAC_ISR5_IAF167             (0x1u<<7)
#define IAC_ISR5_IAF166             (0x1u<<6)
#define IAC_ISR5_IAF165             (0x1u<<5)
#define IAC_ISR5_IAF164             (0x1u<<4)
#define IAC_ISR5_IAF163             (0x1u<<3)
#define IAC_ISR5_IAF162             (0x1u<<2)
#define IAC_ISR5_IAF161             (0x1u<<1)
#define IAC_ISR5_IAF160             (0x1u<<0)

#define IAC_ISR5_IAF191_B_0X0       (0x0u<<31)
#define IAC_ISR5_IAF191_B_0X1       (0x1u<<31)
#define IAC_ISR5_IAF190_B_0X0       (0x0u<<30)
#define IAC_ISR5_IAF190_B_0X1       (0x1u<<30)
#define IAC_ISR5_IAF189_B_0X0       (0x0u<<29)
#define IAC_ISR5_IAF189_B_0X1       (0x1u<<29)
#define IAC_ISR5_IAF188_B_0X0       (0x0u<<28)
#define IAC_ISR5_IAF188_B_0X1       (0x1u<<28)
#define IAC_ISR5_IAF187_B_0X0       (0x0u<<27)
#define IAC_ISR5_IAF187_B_0X1       (0x1u<<27)
#define IAC_ISR5_IAF186_B_0X0       (0x0u<<26)
#define IAC_ISR5_IAF186_B_0X1       (0x1u<<26)
#define IAC_ISR5_IAF185_B_0X0       (0x0u<<25)
#define IAC_ISR5_IAF185_B_0X1       (0x1u<<25)
#define IAC_ISR5_IAF184_B_0X0       (0x0u<<24)
#define IAC_ISR5_IAF184_B_0X1       (0x1u<<24)
#define IAC_ISR5_IAF183_B_0X0       (0x0u<<23)
#define IAC_ISR5_IAF183_B_0X1       (0x1u<<23)
#define IAC_ISR5_IAF182_B_0X0       (0x0u<<22)
#define IAC_ISR5_IAF182_B_0X1       (0x1u<<22)
#define IAC_ISR5_IAF181_B_0X0       (0x0u<<21)
#define IAC_ISR5_IAF181_B_0X1       (0x1u<<21)
#define IAC_ISR5_IAF180_B_0X0       (0x0u<<20)
#define IAC_ISR5_IAF180_B_0X1       (0x1u<<20)
#define IAC_ISR5_IAF179_B_0X0       (0x0u<<19)
#define IAC_ISR5_IAF179_B_0X1       (0x1u<<19)
#define IAC_ISR5_IAF178_B_0X0       (0x0u<<18)
#define IAC_ISR5_IAF178_B_0X1       (0x1u<<18)
#define IAC_ISR5_IAF177_B_0X0       (0x0u<<17)
#define IAC_ISR5_IAF177_B_0X1       (0x1u<<17)
#define IAC_ISR5_IAF176_B_0X0       (0x0u<<16)
#define IAC_ISR5_IAF176_B_0X1       (0x1u<<16)
#define IAC_ISR5_IAF175_B_0X0       (0x0u<<15)
#define IAC_ISR5_IAF175_B_0X1       (0x1u<<15)
#define IAC_ISR5_IAF174_B_0X0       (0x0u<<14)
#define IAC_ISR5_IAF174_B_0X1       (0x1u<<14)
#define IAC_ISR5_IAF173_B_0X0       (0x0u<<13)
#define IAC_ISR5_IAF173_B_0X1       (0x1u<<13)
#define IAC_ISR5_IAF172_B_0X0       (0x0u<<12)
#define IAC_ISR5_IAF172_B_0X1       (0x1u<<12)
#define IAC_ISR5_IAF171_B_0X0       (0x0u<<11)
#define IAC_ISR5_IAF171_B_0X1       (0x1u<<11)
#define IAC_ISR5_IAF170_B_0X0       (0x0u<<10)
#define IAC_ISR5_IAF170_B_0X1       (0x1u<<10)
#define IAC_ISR5_IAF169_B_0X0       (0x0u<<9)
#define IAC_ISR5_IAF169_B_0X1       (0x1u<<9)
#define IAC_ISR5_IAF168_B_0X0       (0x0u<<8)
#define IAC_ISR5_IAF168_B_0X1       (0x1u<<8)
#define IAC_ISR5_IAF167_B_0X0       (0x0u<<7)
#define IAC_ISR5_IAF167_B_0X1       (0x1u<<7)
#define IAC_ISR5_IAF166_B_0X0       (0x0u<<6)
#define IAC_ISR5_IAF166_B_0X1       (0x1u<<6)
#define IAC_ISR5_IAF165_B_0X0       (0x0u<<5)
#define IAC_ISR5_IAF165_B_0X1       (0x1u<<5)
#define IAC_ISR5_IAF164_B_0X0       (0x0u<<4)
#define IAC_ISR5_IAF164_B_0X1       (0x1u<<4)
#define IAC_ISR5_IAF163_B_0X0       (0x0u<<3)
#define IAC_ISR5_IAF163_B_0X1       (0x1u<<3)
#define IAC_ISR5_IAF162_B_0X0       (0x0u<<2)
#define IAC_ISR5_IAF162_B_0X1       (0x1u<<2)
#define IAC_ISR5_IAF161_B_0X0       (0x0u<<1)
#define IAC_ISR5_IAF161_B_0X1       (0x1u<<1)
#define IAC_ISR5_IAF160_B_0X0       (0x0u<<0)
#define IAC_ISR5_IAF160_B_0X1       (0x1u<<0)

// ISR6 Configuration

#define IAC_ISR6_IAF223             (0x1u<<31)
#define IAC_ISR6_IAF222             (0x1u<<30)
#define IAC_ISR6_IAF221             (0x1u<<29)
#define IAC_ISR6_IAF220             (0x1u<<28)
#define IAC_ISR6_IAF219             (0x1u<<27)
#define IAC_ISR6_IAF218             (0x1u<<26)
#define IAC_ISR6_IAF217             (0x1u<<25)
#define IAC_ISR6_IAF216             (0x1u<<24)
#define IAC_ISR6_IAF215             (0x1u<<23)
#define IAC_ISR6_IAF214             (0x1u<<22)
#define IAC_ISR6_IAF213             (0x1u<<21)
#define IAC_ISR6_IAF212             (0x1u<<20)
#define IAC_ISR6_IAF211             (0x1u<<19)
#define IAC_ISR6_IAF210             (0x1u<<18)
#define IAC_ISR6_IAF209             (0x1u<<17)
#define IAC_ISR6_IAF208             (0x1u<<16)
#define IAC_ISR6_IAF207             (0x1u<<15)
#define IAC_ISR6_IAF206             (0x1u<<14)
#define IAC_ISR6_IAF205             (0x1u<<13)
#define IAC_ISR6_IAF204             (0x1u<<12)
#define IAC_ISR6_IAF203             (0x1u<<11)
#define IAC_ISR6_IAF202             (0x1u<<10)
#define IAC_ISR6_IAF201             (0x1u<<9)
#define IAC_ISR6_IAF200             (0x1u<<8)
#define IAC_ISR6_IAF199             (0x1u<<7)
#define IAC_ISR6_IAF198             (0x1u<<6)
#define IAC_ISR6_IAF197             (0x1u<<5)
#define IAC_ISR6_IAF196             (0x1u<<4)
#define IAC_ISR6_IAF195             (0x1u<<3)
#define IAC_ISR6_IAF194             (0x1u<<2)
#define IAC_ISR6_IAF193             (0x1u<<1)
#define IAC_ISR6_IAF192             (0x1u<<0)

#define IAC_ISR6_IAF223_B_0X0       (0x0u<<31)
#define IAC_ISR6_IAF223_B_0X1       (0x1u<<31)
#define IAC_ISR6_IAF222_B_0X0       (0x0u<<30)
#define IAC_ISR6_IAF222_B_0X1       (0x1u<<30)
#define IAC_ISR6_IAF221_B_0X0       (0x0u<<29)
#define IAC_ISR6_IAF221_B_0X1       (0x1u<<29)
#define IAC_ISR6_IAF220_B_0X0       (0x0u<<28)
#define IAC_ISR6_IAF220_B_0X1       (0x1u<<28)
#define IAC_ISR6_IAF219_B_0X0       (0x0u<<27)
#define IAC_ISR6_IAF219_B_0X1       (0x1u<<27)
#define IAC_ISR6_IAF218_B_0X0       (0x0u<<26)
#define IAC_ISR6_IAF218_B_0X1       (0x1u<<26)
#define IAC_ISR6_IAF217_B_0X0       (0x0u<<25)
#define IAC_ISR6_IAF217_B_0X1       (0x1u<<25)
#define IAC_ISR6_IAF216_B_0X0       (0x0u<<24)
#define IAC_ISR6_IAF216_B_0X1       (0x1u<<24)
#define IAC_ISR6_IAF215_B_0X0       (0x0u<<23)
#define IAC_ISR6_IAF215_B_0X1       (0x1u<<23)
#define IAC_ISR6_IAF214_B_0X0       (0x0u<<22)
#define IAC_ISR6_IAF214_B_0X1       (0x1u<<22)
#define IAC_ISR6_IAF213_B_0X0       (0x0u<<21)
#define IAC_ISR6_IAF213_B_0X1       (0x1u<<21)
#define IAC_ISR6_IAF212_B_0X0       (0x0u<<20)
#define IAC_ISR6_IAF212_B_0X1       (0x1u<<20)
#define IAC_ISR6_IAF211_B_0X0       (0x0u<<19)
#define IAC_ISR6_IAF211_B_0X1       (0x1u<<19)
#define IAC_ISR6_IAF210_B_0X0       (0x0u<<18)
#define IAC_ISR6_IAF210_B_0X1       (0x1u<<18)
#define IAC_ISR6_IAF209_B_0X0       (0x0u<<17)
#define IAC_ISR6_IAF209_B_0X1       (0x1u<<17)
#define IAC_ISR6_IAF208_B_0X0       (0x0u<<16)
#define IAC_ISR6_IAF208_B_0X1       (0x1u<<16)
#define IAC_ISR6_IAF207_B_0X0       (0x0u<<15)
#define IAC_ISR6_IAF207_B_0X1       (0x1u<<15)
#define IAC_ISR6_IAF206_B_0X0       (0x0u<<14)
#define IAC_ISR6_IAF206_B_0X1       (0x1u<<14)
#define IAC_ISR6_IAF205_B_0X0       (0x0u<<13)
#define IAC_ISR6_IAF205_B_0X1       (0x1u<<13)
#define IAC_ISR6_IAF204_B_0X0       (0x0u<<12)
#define IAC_ISR6_IAF204_B_0X1       (0x1u<<12)
#define IAC_ISR6_IAF203_B_0X0       (0x0u<<11)
#define IAC_ISR6_IAF203_B_0X1       (0x1u<<11)
#define IAC_ISR6_IAF202_B_0X0       (0x0u<<10)
#define IAC_ISR6_IAF202_B_0X1       (0x1u<<10)
#define IAC_ISR6_IAF201_B_0X0       (0x0u<<9)
#define IAC_ISR6_IAF201_B_0X1       (0x1u<<9)
#define IAC_ISR6_IAF200_B_0X0       (0x0u<<8)
#define IAC_ISR6_IAF200_B_0X1       (0x1u<<8)
#define IAC_ISR6_IAF199_B_0X0       (0x0u<<7)
#define IAC_ISR6_IAF199_B_0X1       (0x1u<<7)
#define IAC_ISR6_IAF198_B_0X0       (0x0u<<6)
#define IAC_ISR6_IAF198_B_0X1       (0x1u<<6)
#define IAC_ISR6_IAF197_B_0X0       (0x0u<<5)
#define IAC_ISR6_IAF197_B_0X1       (0x1u<<5)
#define IAC_ISR6_IAF196_B_0X0       (0x0u<<4)
#define IAC_ISR6_IAF196_B_0X1       (0x1u<<4)
#define IAC_ISR6_IAF195_B_0X0       (0x0u<<3)
#define IAC_ISR6_IAF195_B_0X1       (0x1u<<3)
#define IAC_ISR6_IAF194_B_0X0       (0x0u<<2)
#define IAC_ISR6_IAF194_B_0X1       (0x1u<<2)
#define IAC_ISR6_IAF193_B_0X0       (0x0u<<1)
#define IAC_ISR6_IAF193_B_0X1       (0x1u<<1)
#define IAC_ISR6_IAF192_B_0X0       (0x0u<<0)
#define IAC_ISR6_IAF192_B_0X1       (0x1u<<0)

// ISR7 Configuration

#define IAC_ISR7_IAF255             (0x1u<<31)
#define IAC_ISR7_IAF254             (0x1u<<30)
#define IAC_ISR7_IAF253             (0x1u<<29)
#define IAC_ISR7_IAF252             (0x1u<<28)
#define IAC_ISR7_IAF251             (0x1u<<27)
#define IAC_ISR7_IAF250             (0x1u<<26)
#define IAC_ISR7_IAF249             (0x1u<<25)
#define IAC_ISR7_IAF248             (0x1u<<24)
#define IAC_ISR7_IAF247             (0x1u<<23)
#define IAC_ISR7_IAF246             (0x1u<<22)
#define IAC_ISR7_IAF245             (0x1u<<21)
#define IAC_ISR7_IAF244             (0x1u<<20)
#define IAC_ISR7_IAF243             (0x1u<<19)
#define IAC_ISR7_IAF242             (0x1u<<18)
#define IAC_ISR7_IAF241             (0x1u<<17)
#define IAC_ISR7_IAF240             (0x1u<<16)
#define IAC_ISR7_IAF239             (0x1u<<15)
#define IAC_ISR7_IAF238             (0x1u<<14)
#define IAC_ISR7_IAF237             (0x1u<<13)
#define IAC_ISR7_IAF236             (0x1u<<12)
#define IAC_ISR7_IAF235             (0x1u<<11)
#define IAC_ISR7_IAF234             (0x1u<<10)
#define IAC_ISR7_IAF233             (0x1u<<9)
#define IAC_ISR7_IAF232             (0x1u<<8)
#define IAC_ISR7_IAF231             (0x1u<<7)
#define IAC_ISR7_IAF230             (0x1u<<6)
#define IAC_ISR7_IAF229             (0x1u<<5)
#define IAC_ISR7_IAF228             (0x1u<<4)
#define IAC_ISR7_IAF227             (0x1u<<3)
#define IAC_ISR7_IAF226             (0x1u<<2)
#define IAC_ISR7_IAF225             (0x1u<<1)
#define IAC_ISR7_IAF224             (0x1u<<0)

#define IAC_ISR7_IAF255_B_0X0       (0x0u<<31)
#define IAC_ISR7_IAF255_B_0X1       (0x1u<<31)
#define IAC_ISR7_IAF254_B_0X0       (0x0u<<30)
#define IAC_ISR7_IAF254_B_0X1       (0x1u<<30)
#define IAC_ISR7_IAF253_B_0X0       (0x0u<<29)
#define IAC_ISR7_IAF253_B_0X1       (0x1u<<29)
#define IAC_ISR7_IAF252_B_0X0       (0x0u<<28)
#define IAC_ISR7_IAF252_B_0X1       (0x1u<<28)
#define IAC_ISR7_IAF251_B_0X0       (0x0u<<27)
#define IAC_ISR7_IAF251_B_0X1       (0x1u<<27)
#define IAC_ISR7_IAF250_B_0X0       (0x0u<<26)
#define IAC_ISR7_IAF250_B_0X1       (0x1u<<26)
#define IAC_ISR7_IAF249_B_0X0       (0x0u<<25)
#define IAC_ISR7_IAF249_B_0X1       (0x1u<<25)
#define IAC_ISR7_IAF248_B_0X0       (0x0u<<24)
#define IAC_ISR7_IAF248_B_0X1       (0x1u<<24)
#define IAC_ISR7_IAF247_B_0X0       (0x0u<<23)
#define IAC_ISR7_IAF247_B_0X1       (0x1u<<23)
#define IAC_ISR7_IAF246_B_0X0       (0x0u<<22)
#define IAC_ISR7_IAF246_B_0X1       (0x1u<<22)
#define IAC_ISR7_IAF245_B_0X0       (0x0u<<21)
#define IAC_ISR7_IAF245_B_0X1       (0x1u<<21)
#define IAC_ISR7_IAF244_B_0X0       (0x0u<<20)
#define IAC_ISR7_IAF244_B_0X1       (0x1u<<20)
#define IAC_ISR7_IAF243_B_0X0       (0x0u<<19)
#define IAC_ISR7_IAF243_B_0X1       (0x1u<<19)
#define IAC_ISR7_IAF242_B_0X0       (0x0u<<18)
#define IAC_ISR7_IAF242_B_0X1       (0x1u<<18)
#define IAC_ISR7_IAF241_B_0X0       (0x0u<<17)
#define IAC_ISR7_IAF241_B_0X1       (0x1u<<17)
#define IAC_ISR7_IAF240_B_0X0       (0x0u<<16)
#define IAC_ISR7_IAF240_B_0X1       (0x1u<<16)
#define IAC_ISR7_IAF239_B_0X0       (0x0u<<15)
#define IAC_ISR7_IAF239_B_0X1       (0x1u<<15)
#define IAC_ISR7_IAF238_B_0X0       (0x0u<<14)
#define IAC_ISR7_IAF238_B_0X1       (0x1u<<14)
#define IAC_ISR7_IAF237_B_0X0       (0x0u<<13)
#define IAC_ISR7_IAF237_B_0X1       (0x1u<<13)
#define IAC_ISR7_IAF236_B_0X0       (0x0u<<12)
#define IAC_ISR7_IAF236_B_0X1       (0x1u<<12)
#define IAC_ISR7_IAF235_B_0X0       (0x0u<<11)
#define IAC_ISR7_IAF235_B_0X1       (0x1u<<11)
#define IAC_ISR7_IAF234_B_0X0       (0x0u<<10)
#define IAC_ISR7_IAF234_B_0X1       (0x1u<<10)
#define IAC_ISR7_IAF233_B_0X0       (0x0u<<9)
#define IAC_ISR7_IAF233_B_0X1       (0x1u<<9)
#define IAC_ISR7_IAF232_B_0X0       (0x0u<<8)
#define IAC_ISR7_IAF232_B_0X1       (0x1u<<8)
#define IAC_ISR7_IAF231_B_0X0       (0x0u<<7)
#define IAC_ISR7_IAF231_B_0X1       (0x1u<<7)
#define IAC_ISR7_IAF230_B_0X0       (0x0u<<6)
#define IAC_ISR7_IAF230_B_0X1       (0x1u<<6)
#define IAC_ISR7_IAF229_B_0X0       (0x0u<<5)
#define IAC_ISR7_IAF229_B_0X1       (0x1u<<5)
#define IAC_ISR7_IAF228_B_0X0       (0x0u<<4)
#define IAC_ISR7_IAF228_B_0X1       (0x1u<<4)
#define IAC_ISR7_IAF227_B_0X0       (0x0u<<3)
#define IAC_ISR7_IAF227_B_0X1       (0x1u<<3)
#define IAC_ISR7_IAF226_B_0X0       (0x0u<<2)
#define IAC_ISR7_IAF226_B_0X1       (0x1u<<2)
#define IAC_ISR7_IAF225_B_0X0       (0x0u<<1)
#define IAC_ISR7_IAF225_B_0X1       (0x1u<<1)
#define IAC_ISR7_IAF224_B_0X0       (0x0u<<0)
#define IAC_ISR7_IAF224_B_0X1       (0x1u<<0)

