Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_ICR5_IAF191_B_0X0       (0x0u<<31)
#define IAC_ICR5_IAF191_B_0X1       (0x1u<<31)
#define IAC_ICR5_IAF190_B_0X0       (0x0u<<30)
#define IAC_ICR5_IAF190_B_0X1       (0x1u<<30)
#define IAC_ICR5_IAF189_B_0X0       (0x0u<<29)
#define IAC_ICR5_IAF189_B_0X1       (0x1u<<29)
#define IAC_ICR5_IAF188_B_0X0       (0x0u<<28)
#define IAC_ICR5_IAF188_B_0X1       (0x1u<<28)
#define IAC_ICR5_IAF187_B_0X0       (0x0u<<27)
#define IAC_ICR5_IAF187_B_0X1       (0x1u<<27)
#define IAC_ICR5_IAF186_B_0X0       (0x0u<<26)
#define IAC_ICR5_IAF186_B_0X1       (0x1u<<26)
#define IAC_ICR5_IAF185_B_0X0       (0x0u<<25)
#define IAC_ICR5_IAF185_B_0X1       (0x1u<<25)
#define IAC_ICR5_IAF184_B_0X0       (0x0u<<24)
#define IAC_ICR5_IAF184_B_0X1       (0x1u<<24)
#define IAC_ICR5_IAF183_B_0X0       (0x0u<<23)
#define IAC_ICR5_IAF183_B_0X1       (0x1u<<23)
#define IAC_ICR5_IAF182_B_0X0       (0x0u<<22)
#define IAC_ICR5_IAF182_B_0X1       (0x1u<<22)
#define IAC_ICR5_IAF181_B_0X0       (0x0u<<21)
#define IAC_ICR5_IAF181_B_0X1       (0x1u<<21)
#define IAC_ICR5_IAF180_B_0X0       (0x0u<<20)
#define IAC_ICR5_IAF180_B_0X1       (0x1u<<20)
#define IAC_ICR5_IAF179_B_0X0       (0x0u<<19)
#define IAC_ICR5_IAF179_B_0X1       (0x1u<<19)
#define IAC_ICR5_IAF178_B_0X0       (0x0u<<18)
#define IAC_ICR5_IAF178_B_0X1       (0x1u<<18)
#define IAC_ICR5_IAF177_B_0X0       (0x0u<<17)
#define IAC_ICR5_IAF177_B_0X1       (0x1u<<17)
#define IAC_ICR5_IAF176_B_0X0       (0x0u<<16)
#define IAC_ICR5_IAF176_B_0X1       (0x1u<<16)
#define IAC_ICR5_IAF175_B_0X0       (0x0u<<15)
#define IAC_ICR5_IAF175_B_0X1       (0x1u<<15)
#define IAC_ICR5_IAF174_B_0X0       (0x0u<<14)
#define IAC_ICR5_IAF174_B_0X1       (0x1u<<14)
#define IAC_ICR5_IAF173_B_0X0       (0x0u<<13)
#define IAC_ICR5_IAF173_B_0X1       (0x1u<<13)
#define IAC_ICR5_IAF172_B_0X0       (0x0u<<12)
#define IAC_ICR5_IAF172_B_0X1       (0x1u<<12)
#define IAC_ICR5_IAF171_B_0X0       (0x0u<<11)
#define IAC_ICR5_IAF171_B_0X1       (0x1u<<11)
#define IAC_ICR5_IAF170_B_0X0       (0x0u<<10)
#define IAC_ICR5_IAF170_B_0X1       (0x1u<<10)
#define IAC_ICR5_IAF169_B_0X0       (0x0u<<9)
#define IAC_ICR5_IAF169_B_0X1       (0x1u<<9)
#define IAC_ICR5_IAF168_B_0X0       (0x0u<<8)
#define IAC_ICR5_IAF168_B_0X1       (0x1u<<8)
#define IAC_ICR5_IAF167_B_0X0       (0x0u<<7)
#define IAC_ICR5_IAF167_B_0X1       (0x1u<<7)
#define IAC_ICR5_IAF166_B_0X0       (0x0u<<6)
#define IAC_ICR5_IAF166_B_0X1       (0x1u<<6)
#define IAC_ICR5_IAF165_B_0X0       (0x0u<<5)
#define IAC_ICR5_IAF165_B_0X1       (0x1u<<5)
#define IAC_ICR5_IAF164_B_0X0       (0x0u<<4)
#define IAC_ICR5_IAF164_B_0X1       (0x1u<<4)
#define IAC_ICR5_IAF163_B_0X0       (0x0u<<3)
#define IAC_ICR5_IAF163_B_0X1       (0x1u<<3)
#define IAC_ICR5_IAF162_B_0X0       (0x0u<<2)
#define IAC_ICR5_IAF162_B_0X1       (0x1u<<2)
#define IAC_ICR5_IAF161_B_0X0       (0x0u<<1)
#define IAC_ICR5_IAF161_B_0X1       (0x1u<<1)
#define IAC_ICR5_IAF160_B_0X0       (0x0u<<0)
#define IAC_ICR5_IAF160_B_0X1       (0x1u<<0)

// ICR6 Configuration

#define IAC_ICR6_IAF223             (0x1u<<31)
#define IAC_ICR6_IAF222             (0x1u<<30)
#define IAC_ICR6_IAF221             (0x1u<<29)
#define IAC_ICR6_IAF220             (0x1u<<28)
#define IAC_ICR6_IAF219             (0x1u<<27)
#define IAC_ICR6_IAF218             (0x1u<<26)
#define IAC_ICR6_IAF217             (0x1u<<25)
#define IAC_ICR6_IAF216             (0x1u<<24)
#define IAC_ICR6_IAF215             (0x1u<<23)
#define IAC_ICR6_IAF214             (0x1u<<22)
#define IAC_ICR6_IAF213             (0x1u<<21)
#define IAC_ICR6_IAF212             (0x1u<<20)
#define IAC_ICR6_IAF211             (0x1u<<19)
#define IAC_ICR6_IAF210             (0x1u<<18)
#define IAC_ICR6_IAF209             (0x1u<<17)
#define IAC_ICR6_IAF208             (0x1u<<16)
#define IAC_ICR6_IAF207             (0x1u<<15)
#define IAC_ICR6_IAF206             (0x1u<<14)
#define IAC_ICR6_IAF205             (0x1u<<13)
#define IAC_ICR6_IAF204             (0x1u<<12)
#define IAC_ICR6_IAF203             (0x1u<<11)
#define IAC_ICR6_IAF202             (0x1u<<10)
#define IAC_ICR6_IAF201             (0x1u<<9)
#define IAC_ICR6_IAF200             (0x1u<<8)
#define IAC_ICR6_IAF199             (0x1u<<7)
#define IAC_ICR6_IAF198             (0x1u<<6)
#define IAC_ICR6_IAF197             (0x1u<<5)
#define IAC_ICR6_IAF196             (0x1u<<4)
#define IAC_ICR6_IAF195             (0x1u<<3)
#define IAC_ICR6_IAF194             (0x1u<<2)
#define IAC_ICR6_IAF193             (0x1u<<1)
#define IAC_ICR6_IAF192             (0x1u<<0)

#define IAC_ICR6_IAF223_B_0X0       (0x0u<<31)
#define IAC_ICR6_IAF223_B_0X1       (0x1u<<31)
#define IAC_ICR6_IAF222_B_0X0       (0x0u<<30)
#define IAC_ICR6_IAF222_B_0X1       (0x1u<<30)
#define IAC_ICR6_IAF221_B_0X0       (0x0u<<29)
#define IAC_ICR6_IAF221_B_0X1       (0x1u<<29)
#define IAC_ICR6_IAF220_B_0X0       (0x0u<<28)
#define IAC_ICR6_IAF220_B_0X1       (0x1u<<28)
#define IAC_ICR6_IAF219_B_0X0       (0x0u<<27)
#define IAC_ICR6_IAF219_B_0X1       (0x1u<<27)
#define IAC_ICR6_IAF218_B_0X0       (0x0u<<26)
#define IAC_ICR6_IAF218_B_0X1       (0x1u<<26)
#define IAC_ICR6_IAF217_B_0X0       (0x0u<<25)
#define IAC_ICR6_IAF217_B_0X1       (0x1u<<25)
#define IAC_ICR6_IAF216_B_0X0       (0x0u<<24)
#define IAC_ICR6_IAF216_B_0X1       (0x1u<<24)
#define IAC_ICR6_IAF215_B_0X0       (0x0u<<23)
#define IAC_ICR6_IAF215_B_0X1       (0x1u<<23)
#define IAC_ICR6_IAF214_B_0X0       (0x0u<<22)
#define IAC_ICR6_IAF214_B_0X1       (0x1u<<22)
#define IAC_ICR6_IAF213_B_0X0       (0x0u<<21)
#define IAC_ICR6_IAF213_B_0X1       (0x1u<<21)
#define IAC_ICR6_IAF212_B_0X0       (0x0u<<20)
#define IAC_ICR6_IAF212_B_0X1       (0x1u<<20)
#define IAC_ICR6_IAF211_B_0X0       (0x0u<<19)
#define IAC_ICR6_IAF211_B_0X1       (0x1u<<19)
#define IAC_ICR6_IAF210_B_0X0       (0x0u<<18)
#define IAC_ICR6_IAF210_B_0X1       (0x1u<<18)
#define IAC_ICR6_IAF209_B_0X0       (0x0u<<17)
#define IAC_ICR6_IAF209_B_0X1       (0x1u<<17)
#define IAC_ICR6_IAF208_B_0X0       (0x0u<<16)
#define IAC_ICR6_IAF208_B_0X1       (0x1u<<16)
#define IAC_ICR6_IAF207_B_0X0       (0x0u<<15)
#define IAC_ICR6_IAF207_B_0X1       (0x1u<<15)
#define IAC_ICR6_IAF206_B_0X0       (0x0u<<14)
#define IAC_ICR6_IAF206_B_0X1       (0x1u<<14)
#define IAC_ICR6_IAF205_B_0X0       (0x0u<<13)
#define IAC_ICR6_IAF205_B_0X1       (0x1u<<13)
#define IAC_ICR6_IAF204_B_0X0       (0x0u<<12)
#define IAC_ICR6_IAF204_B_0X1       (0x1u<<12)
#define IAC_ICR6_IAF203_B_0X0       (0x0u<<11)
#define IAC_ICR6_IAF203_B_0X1       (0x1u<<11)
#define IAC_ICR6_IAF202_B_0X0       (0x0u<<10)
#define IAC_ICR6_IAF202_B_0X1       (0x1u<<10)
#define IAC_ICR6_IAF201_B_0X0       (0x0u<<9)
#define IAC_ICR6_IAF201_B_0X1       (0x1u<<9)
#define IAC_ICR6_IAF200_B_0X0       (0x0u<<8)
#define IAC_ICR6_IAF200_B_0X1       (0x1u<<8)
#define IAC_ICR6_IAF199_B_0X0       (0x0u<<7)
#define IAC_ICR6_IAF199_B_0X1       (0x1u<<7)
#define IAC_ICR6_IAF198_B_0X0       (0x0u<<6)
#define IAC_ICR6_IAF198_B_0X1       (0x1u<<6)
#define IAC_ICR6_IAF197_B_0X0       (0x0u<<5)
#define IAC_ICR6_IAF197_B_0X1       (0x1u<<5)
#define IAC_ICR6_IAF196_B_0X0       (0x0u<<4)
#define IAC_ICR6_IAF196_B_0X1       (0x1u<<4)
#define IAC_ICR6_IAF195_B_0X0       (0x0u<<3)
#define IAC_ICR6_IAF195_B_0X1       (0x1u<<3)
#define IAC_ICR6_IAF194_B_0X0       (0x0u<<2)
#define IAC_ICR6_IAF194_B_0X1       (0x1u<<2)
#define IAC_ICR6_IAF193_B_0X0       (0x0u<<1)
#define IAC_ICR6_IAF193_B_0X1       (0x1u<<1)
#define IAC_ICR6_IAF192_B_0X0       (0x0u<<0)
#define IAC_ICR6_IAF192_B_0X1       (0x1u<<0)

// ICR7 Configuration

