Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_ICR7_IAF255             (0x1u<<31)
#define IAC_ICR7_IAF254             (0x1u<<30)
#define IAC_ICR7_IAF253             (0x1u<<29)
#define IAC_ICR7_IAF252             (0x1u<<28)
#define IAC_ICR7_IAF251             (0x1u<<27)
#define IAC_ICR7_IAF250             (0x1u<<26)
#define IAC_ICR7_IAF249             (0x1u<<25)
#define IAC_ICR7_IAF248             (0x1u<<24)
#define IAC_ICR7_IAF247             (0x1u<<23)
#define IAC_ICR7_IAF246             (0x1u<<22)
#define IAC_ICR7_IAF245             (0x1u<<21)
#define IAC_ICR7_IAF244             (0x1u<<20)
#define IAC_ICR7_IAF243             (0x1u<<19)
#define IAC_ICR7_IAF242             (0x1u<<18)
#define IAC_ICR7_IAF241             (0x1u<<17)
#define IAC_ICR7_IAF240             (0x1u<<16)
#define IAC_ICR7_IAF239             (0x1u<<15)
#define IAC_ICR7_IAF238             (0x1u<<14)
#define IAC_ICR7_IAF237             (0x1u<<13)
#define IAC_ICR7_IAF236             (0x1u<<12)
#define IAC_ICR7_IAF235             (0x1u<<11)
#define IAC_ICR7_IAF234             (0x1u<<10)
#define IAC_ICR7_IAF233             (0x1u<<9)
#define IAC_ICR7_IAF232             (0x1u<<8)
#define IAC_ICR7_IAF231             (0x1u<<7)
#define IAC_ICR7_IAF230             (0x1u<<6)
#define IAC_ICR7_IAF229             (0x1u<<5)
#define IAC_ICR7_IAF228             (0x1u<<4)
#define IAC_ICR7_IAF227             (0x1u<<3)
#define IAC_ICR7_IAF226             (0x1u<<2)
#define IAC_ICR7_IAF225             (0x1u<<1)
#define IAC_ICR7_IAF224             (0x1u<<0)

#define IAC_ICR7_IAF255_B_0X0       (0x0u<<31)
#define IAC_ICR7_IAF255_B_0X1       (0x1u<<31)
#define IAC_ICR7_IAF254_B_0X0       (0x0u<<30)
#define IAC_ICR7_IAF254_B_0X1       (0x1u<<30)
#define IAC_ICR7_IAF253_B_0X0       (0x0u<<29)
#define IAC_ICR7_IAF253_B_0X1       (0x1u<<29)
#define IAC_ICR7_IAF252_B_0X0       (0x0u<<28)
#define IAC_ICR7_IAF252_B_0X1       (0x1u<<28)
#define IAC_ICR7_IAF251_B_0X0       (0x0u<<27)
#define IAC_ICR7_IAF251_B_0X1       (0x1u<<27)
#define IAC_ICR7_IAF250_B_0X0       (0x0u<<26)
#define IAC_ICR7_IAF250_B_0X1       (0x1u<<26)
#define IAC_ICR7_IAF249_B_0X0       (0x0u<<25)
#define IAC_ICR7_IAF249_B_0X1       (0x1u<<25)
#define IAC_ICR7_IAF248_B_0X0       (0x0u<<24)
#define IAC_ICR7_IAF248_B_0X1       (0x1u<<24)
#define IAC_ICR7_IAF247_B_0X0       (0x0u<<23)
#define IAC_ICR7_IAF247_B_0X1       (0x1u<<23)
#define IAC_ICR7_IAF246_B_0X0       (0x0u<<22)
#define IAC_ICR7_IAF246_B_0X1       (0x1u<<22)
#define IAC_ICR7_IAF245_B_0X0       (0x0u<<21)
#define IAC_ICR7_IAF245_B_0X1       (0x1u<<21)
#define IAC_ICR7_IAF244_B_0X0       (0x0u<<20)
#define IAC_ICR7_IAF244_B_0X1       (0x1u<<20)
#define IAC_ICR7_IAF243_B_0X0       (0x0u<<19)
#define IAC_ICR7_IAF243_B_0X1       (0x1u<<19)
#define IAC_ICR7_IAF242_B_0X0       (0x0u<<18)
#define IAC_ICR7_IAF242_B_0X1       (0x1u<<18)
#define IAC_ICR7_IAF241_B_0X0       (0x0u<<17)
#define IAC_ICR7_IAF241_B_0X1       (0x1u<<17)
#define IAC_ICR7_IAF240_B_0X0       (0x0u<<16)
#define IAC_ICR7_IAF240_B_0X1       (0x1u<<16)
#define IAC_ICR7_IAF239_B_0X0       (0x0u<<15)
#define IAC_ICR7_IAF239_B_0X1       (0x1u<<15)
#define IAC_ICR7_IAF238_B_0X0       (0x0u<<14)
#define IAC_ICR7_IAF238_B_0X1       (0x1u<<14)
#define IAC_ICR7_IAF237_B_0X0       (0x0u<<13)
#define IAC_ICR7_IAF237_B_0X1       (0x1u<<13)
#define IAC_ICR7_IAF236_B_0X0       (0x0u<<12)
#define IAC_ICR7_IAF236_B_0X1       (0x1u<<12)
#define IAC_ICR7_IAF235_B_0X0       (0x0u<<11)
#define IAC_ICR7_IAF235_B_0X1       (0x1u<<11)
#define IAC_ICR7_IAF234_B_0X0       (0x0u<<10)
#define IAC_ICR7_IAF234_B_0X1       (0x1u<<10)
#define IAC_ICR7_IAF233_B_0X0       (0x0u<<9)
#define IAC_ICR7_IAF233_B_0X1       (0x1u<<9)
#define IAC_ICR7_IAF232_B_0X0       (0x0u<<8)
#define IAC_ICR7_IAF232_B_0X1       (0x1u<<8)
#define IAC_ICR7_IAF231_B_0X0       (0x0u<<7)
#define IAC_ICR7_IAF231_B_0X1       (0x1u<<7)
#define IAC_ICR7_IAF230_B_0X0       (0x0u<<6)
#define IAC_ICR7_IAF230_B_0X1       (0x1u<<6)
#define IAC_ICR7_IAF229_B_0X0       (0x0u<<5)
#define IAC_ICR7_IAF229_B_0X1       (0x1u<<5)
#define IAC_ICR7_IAF228_B_0X0       (0x0u<<4)
#define IAC_ICR7_IAF228_B_0X1       (0x1u<<4)
#define IAC_ICR7_IAF227_B_0X0       (0x0u<<3)
#define IAC_ICR7_IAF227_B_0X1       (0x1u<<3)
#define IAC_ICR7_IAF226_B_0X0       (0x0u<<2)
#define IAC_ICR7_IAF226_B_0X1       (0x1u<<2)
#define IAC_ICR7_IAF225_B_0X0       (0x0u<<1)
#define IAC_ICR7_IAF225_B_0X1       (0x1u<<1)
#define IAC_ICR7_IAF224_B_0X0       (0x0u<<0)
#define IAC_ICR7_IAF224_B_0X1       (0x1u<<0)

// IISR0 Configuration

#define IAC_IISR0_ILACIN31          (0x1u<<31)
#define IAC_IISR0_ILACIN30          (0x1u<<30)
#define IAC_IISR0_ILACIN29          (0x1u<<29)
#define IAC_IISR0_ILACIN28          (0x1u<<28)
#define IAC_IISR0_ILACIN27          (0x1u<<27)
#define IAC_IISR0_ILACIN26          (0x1u<<26)
#define IAC_IISR0_ILACIN25          (0x1u<<25)
#define IAC_IISR0_ILACIN24          (0x1u<<24)
#define IAC_IISR0_ILACIN23          (0x1u<<23)
#define IAC_IISR0_ILACIN22          (0x1u<<22)
#define IAC_IISR0_ILACIN21          (0x1u<<21)
#define IAC_IISR0_ILACIN20          (0x1u<<20)
#define IAC_IISR0_ILACIN19          (0x1u<<19)
#define IAC_IISR0_ILACIN18          (0x1u<<18)
#define IAC_IISR0_ILACIN17          (0x1u<<17)
#define IAC_IISR0_ILACIN16          (0x1u<<16)
#define IAC_IISR0_ILACIN15          (0x1u<<15)
#define IAC_IISR0_ILACIN14          (0x1u<<14)
#define IAC_IISR0_ILACIN13          (0x1u<<13)
#define IAC_IISR0_ILACIN12          (0x1u<<12)
#define IAC_IISR0_ILACIN11          (0x1u<<11)
#define IAC_IISR0_ILACIN10          (0x1u<<10)
#define IAC_IISR0_ILACIN9           (0x1u<<9)
#define IAC_IISR0_ILACIN8           (0x1u<<8)
#define IAC_IISR0_ILACIN7           (0x1u<<7)
#define IAC_IISR0_ILACIN6           (0x1u<<6)
#define IAC_IISR0_ILACIN5           (0x1u<<5)
#define IAC_IISR0_ILACIN4           (0x1u<<4)
#define IAC_IISR0_ILACIN3           (0x1u<<3)
#define IAC_IISR0_ILACIN2           (0x1u<<2)
#define IAC_IISR0_ILACIN1           (0x1u<<1)
#define IAC_IISR0_ILACIN0           (0x1u<<0)

