Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_IISR0_ILACIN31_B_0X0    (0x0u<<31)
#define IAC_IISR0_ILACIN31_B_0X1    (0x1u<<31)
#define IAC_IISR0_ILACIN30_B_0X0    (0x0u<<30)
#define IAC_IISR0_ILACIN30_B_0X1    (0x1u<<30)
#define IAC_IISR0_ILACIN29_B_0X0    (0x0u<<29)
#define IAC_IISR0_ILACIN29_B_0X1    (0x1u<<29)
#define IAC_IISR0_ILACIN28_B_0X0    (0x0u<<28)
#define IAC_IISR0_ILACIN28_B_0X1    (0x1u<<28)
#define IAC_IISR0_ILACIN27_B_0X0    (0x0u<<27)
#define IAC_IISR0_ILACIN27_B_0X1    (0x1u<<27)
#define IAC_IISR0_ILACIN26_B_0X0    (0x0u<<26)
#define IAC_IISR0_ILACIN26_B_0X1    (0x1u<<26)
#define IAC_IISR0_ILACIN25_B_0X0    (0x0u<<25)
#define IAC_IISR0_ILACIN25_B_0X1    (0x1u<<25)
#define IAC_IISR0_ILACIN24_B_0X0    (0x0u<<24)
#define IAC_IISR0_ILACIN24_B_0X1    (0x1u<<24)
#define IAC_IISR0_ILACIN23_B_0X0    (0x0u<<23)
#define IAC_IISR0_ILACIN23_B_0X1    (0x1u<<23)
#define IAC_IISR0_ILACIN22_B_0X0    (0x0u<<22)
#define IAC_IISR0_ILACIN22_B_0X1    (0x1u<<22)
#define IAC_IISR0_ILACIN21_B_0X0    (0x0u<<21)
#define IAC_IISR0_ILACIN21_B_0X1    (0x1u<<21)
#define IAC_IISR0_ILACIN20_B_0X0    (0x0u<<20)
#define IAC_IISR0_ILACIN20_B_0X1    (0x1u<<20)
#define IAC_IISR0_ILACIN19_B_0X0    (0x0u<<19)
#define IAC_IISR0_ILACIN19_B_0X1    (0x1u<<19)
#define IAC_IISR0_ILACIN18_B_0X0    (0x0u<<18)
#define IAC_IISR0_ILACIN18_B_0X1    (0x1u<<18)
#define IAC_IISR0_ILACIN17_B_0X0    (0x0u<<17)
#define IAC_IISR0_ILACIN17_B_0X1    (0x1u<<17)
#define IAC_IISR0_ILACIN16_B_0X0    (0x0u<<16)
#define IAC_IISR0_ILACIN16_B_0X1    (0x1u<<16)
#define IAC_IISR0_ILACIN15_B_0X0    (0x0u<<15)
#define IAC_IISR0_ILACIN15_B_0X1    (0x1u<<15)
#define IAC_IISR0_ILACIN14_B_0X0    (0x0u<<14)
#define IAC_IISR0_ILACIN14_B_0X1    (0x1u<<14)
#define IAC_IISR0_ILACIN13_B_0X0    (0x0u<<13)
#define IAC_IISR0_ILACIN13_B_0X1    (0x1u<<13)
#define IAC_IISR0_ILACIN12_B_0X0    (0x0u<<12)
#define IAC_IISR0_ILACIN12_B_0X1    (0x1u<<12)
#define IAC_IISR0_ILACIN11_B_0X0    (0x0u<<11)
#define IAC_IISR0_ILACIN11_B_0X1    (0x1u<<11)
#define IAC_IISR0_ILACIN10_B_0X0    (0x0u<<10)
#define IAC_IISR0_ILACIN10_B_0X1    (0x1u<<10)
#define IAC_IISR0_ILACIN9_B_0X0     (0x0u<<9)
#define IAC_IISR0_ILACIN9_B_0X1     (0x1u<<9)
#define IAC_IISR0_ILACIN8_B_0X0     (0x0u<<8)
#define IAC_IISR0_ILACIN8_B_0X1     (0x1u<<8)
#define IAC_IISR0_ILACIN7_B_0X0     (0x0u<<7)
#define IAC_IISR0_ILACIN7_B_0X1     (0x1u<<7)
#define IAC_IISR0_ILACIN6_B_0X0     (0x0u<<6)
#define IAC_IISR0_ILACIN6_B_0X1     (0x1u<<6)
#define IAC_IISR0_ILACIN5_B_0X0     (0x0u<<5)
#define IAC_IISR0_ILACIN5_B_0X1     (0x1u<<5)
#define IAC_IISR0_ILACIN4_B_0X0     (0x0u<<4)
#define IAC_IISR0_ILACIN4_B_0X1     (0x1u<<4)
#define IAC_IISR0_ILACIN3_B_0X0     (0x0u<<3)
#define IAC_IISR0_ILACIN3_B_0X1     (0x1u<<3)
#define IAC_IISR0_ILACIN2_B_0X0     (0x0u<<2)
#define IAC_IISR0_ILACIN2_B_0X1     (0x1u<<2)
#define IAC_IISR0_ILACIN1_B_0X0     (0x0u<<1)
#define IAC_IISR0_ILACIN1_B_0X1     (0x1u<<1)
#define IAC_IISR0_ILACIN0_B_0X0     (0x0u<<0)
#define IAC_IISR0_ILACIN0_B_0X1     (0x1u<<0)

// IISR1 Configuration

#define IAC_IISR1_ILACIN63          (0x1u<<31)
#define IAC_IISR1_ILACIN62          (0x1u<<30)
#define IAC_IISR1_ILACIN61          (0x1u<<29)
#define IAC_IISR1_ILACIN60          (0x1u<<28)
#define IAC_IISR1_ILACIN59          (0x1u<<27)
#define IAC_IISR1_ILACIN58          (0x1u<<26)
#define IAC_IISR1_ILACIN57          (0x1u<<25)
#define IAC_IISR1_ILACIN56          (0x1u<<24)
#define IAC_IISR1_ILACIN55          (0x1u<<23)
#define IAC_IISR1_ILACIN54          (0x1u<<22)
#define IAC_IISR1_ILACIN53          (0x1u<<21)
#define IAC_IISR1_ILACIN52          (0x1u<<20)
#define IAC_IISR1_ILACIN51          (0x1u<<19)
#define IAC_IISR1_ILACIN50          (0x1u<<18)
#define IAC_IISR1_ILACIN49          (0x1u<<17)
#define IAC_IISR1_ILACIN48          (0x1u<<16)
#define IAC_IISR1_ILACIN47          (0x1u<<15)
#define IAC_IISR1_ILACIN46          (0x1u<<14)
#define IAC_IISR1_ILACIN45          (0x1u<<13)
#define IAC_IISR1_ILACIN44          (0x1u<<12)
#define IAC_IISR1_ILACIN43          (0x1u<<11)
#define IAC_IISR1_ILACIN42          (0x1u<<10)
#define IAC_IISR1_ILACIN41          (0x1u<<9)
#define IAC_IISR1_ILACIN40          (0x1u<<8)
#define IAC_IISR1_ILACIN39          (0x1u<<7)
#define IAC_IISR1_ILACIN38          (0x1u<<6)
#define IAC_IISR1_ILACIN37          (0x1u<<5)
#define IAC_IISR1_ILACIN36          (0x1u<<4)
#define IAC_IISR1_ILACIN35          (0x1u<<3)
#define IAC_IISR1_ILACIN34          (0x1u<<2)
#define IAC_IISR1_ILACIN33          (0x1u<<1)
#define IAC_IISR1_ILACIN32          (0x1u<<0)

#define IAC_IISR1_ILACIN63_B_0X0    (0x0u<<31)
#define IAC_IISR1_ILACIN63_B_0X1    (0x1u<<31)
#define IAC_IISR1_ILACIN62_B_0X0    (0x0u<<30)
#define IAC_IISR1_ILACIN62_B_0X1    (0x1u<<30)
#define IAC_IISR1_ILACIN61_B_0X0    (0x0u<<29)
#define IAC_IISR1_ILACIN61_B_0X1    (0x1u<<29)
#define IAC_IISR1_ILACIN60_B_0X0    (0x0u<<28)
#define IAC_IISR1_ILACIN60_B_0X1    (0x1u<<28)
#define IAC_IISR1_ILACIN59_B_0X0    (0x0u<<27)
#define IAC_IISR1_ILACIN59_B_0X1    (0x1u<<27)
#define IAC_IISR1_ILACIN58_B_0X0    (0x0u<<26)
#define IAC_IISR1_ILACIN58_B_0X1    (0x1u<<26)
#define IAC_IISR1_ILACIN57_B_0X0    (0x0u<<25)
#define IAC_IISR1_ILACIN57_B_0X1    (0x1u<<25)
#define IAC_IISR1_ILACIN56_B_0X0    (0x0u<<24)
#define IAC_IISR1_ILACIN56_B_0X1    (0x1u<<24)
#define IAC_IISR1_ILACIN55_B_0X0    (0x0u<<23)
#define IAC_IISR1_ILACIN55_B_0X1    (0x1u<<23)
#define IAC_IISR1_ILACIN54_B_0X0    (0x0u<<22)
#define IAC_IISR1_ILACIN54_B_0X1    (0x1u<<22)
#define IAC_IISR1_ILACIN53_B_0X0    (0x0u<<21)
#define IAC_IISR1_ILACIN53_B_0X1    (0x1u<<21)
#define IAC_IISR1_ILACIN52_B_0X0    (0x0u<<20)
#define IAC_IISR1_ILACIN52_B_0X1    (0x1u<<20)
#define IAC_IISR1_ILACIN51_B_0X0    (0x0u<<19)
#define IAC_IISR1_ILACIN51_B_0X1    (0x1u<<19)
#define IAC_IISR1_ILACIN50_B_0X0    (0x0u<<18)
#define IAC_IISR1_ILACIN50_B_0X1    (0x1u<<18)
#define IAC_IISR1_ILACIN49_B_0X0    (0x0u<<17)
#define IAC_IISR1_ILACIN49_B_0X1    (0x1u<<17)
#define IAC_IISR1_ILACIN48_B_0X0    (0x0u<<16)
#define IAC_IISR1_ILACIN48_B_0X1    (0x1u<<16)
#define IAC_IISR1_ILACIN47_B_0X0    (0x0u<<15)
#define IAC_IISR1_ILACIN47_B_0X1    (0x1u<<15)
#define IAC_IISR1_ILACIN46_B_0X0    (0x0u<<14)
#define IAC_IISR1_ILACIN46_B_0X1    (0x1u<<14)
#define IAC_IISR1_ILACIN45_B_0X0    (0x0u<<13)
#define IAC_IISR1_ILACIN45_B_0X1    (0x1u<<13)
#define IAC_IISR1_ILACIN44_B_0X0    (0x0u<<12)
#define IAC_IISR1_ILACIN44_B_0X1    (0x1u<<12)
#define IAC_IISR1_ILACIN43_B_0X0    (0x0u<<11)
#define IAC_IISR1_ILACIN43_B_0X1    (0x1u<<11)
#define IAC_IISR1_ILACIN42_B_0X0    (0x0u<<10)
#define IAC_IISR1_ILACIN42_B_0X1    (0x1u<<10)
#define IAC_IISR1_ILACIN41_B_0X0    (0x0u<<9)
#define IAC_IISR1_ILACIN41_B_0X1    (0x1u<<9)
#define IAC_IISR1_ILACIN40_B_0X0    (0x0u<<8)
#define IAC_IISR1_ILACIN40_B_0X1    (0x1u<<8)
#define IAC_IISR1_ILACIN39_B_0X0    (0x0u<<7)
#define IAC_IISR1_ILACIN39_B_0X1    (0x1u<<7)
#define IAC_IISR1_ILACIN38_B_0X0    (0x0u<<6)
#define IAC_IISR1_ILACIN38_B_0X1    (0x1u<<6)
#define IAC_IISR1_ILACIN37_B_0X0    (0x0u<<5)
#define IAC_IISR1_ILACIN37_B_0X1    (0x1u<<5)
#define IAC_IISR1_ILACIN36_B_0X0    (0x0u<<4)
#define IAC_IISR1_ILACIN36_B_0X1    (0x1u<<4)
#define IAC_IISR1_ILACIN35_B_0X0    (0x0u<<3)
#define IAC_IISR1_ILACIN35_B_0X1    (0x1u<<3)
#define IAC_IISR1_ILACIN34_B_0X0    (0x0u<<2)
#define IAC_IISR1_ILACIN34_B_0X1    (0x1u<<2)
#define IAC_IISR1_ILACIN33_B_0X0    (0x0u<<1)
#define IAC_IISR1_ILACIN33_B_0X1    (0x1u<<1)
#define IAC_IISR1_ILACIN32_B_0X0    (0x0u<<0)
#define IAC_IISR1_ILACIN32_B_0X1    (0x1u<<0)

