Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_iac.h
#define IAC_IISR6_ILACIN223         (0x1u<<31)
#define IAC_IISR6_ILACIN222         (0x1u<<30)
#define IAC_IISR6_ILACIN221         (0x1u<<29)
#define IAC_IISR6_ILACIN220         (0x1u<<28)
#define IAC_IISR6_ILACIN219         (0x1u<<27)
#define IAC_IISR6_ILACIN218         (0x1u<<26)
#define IAC_IISR6_ILACIN217         (0x1u<<25)
#define IAC_IISR6_ILACIN216         (0x1u<<24)
#define IAC_IISR6_ILACIN215         (0x1u<<23)
#define IAC_IISR6_ILACIN214         (0x1u<<22)
#define IAC_IISR6_ILACIN213         (0x1u<<21)
#define IAC_IISR6_ILACIN212         (0x1u<<20)
#define IAC_IISR6_ILACIN211         (0x1u<<19)
#define IAC_IISR6_ILACIN210         (0x1u<<18)
#define IAC_IISR6_ILACIN209         (0x1u<<17)
#define IAC_IISR6_ILACIN208         (0x1u<<16)
#define IAC_IISR6_ILACIN207         (0x1u<<15)
#define IAC_IISR6_ILACIN206         (0x1u<<14)
#define IAC_IISR6_ILACIN205         (0x1u<<13)
#define IAC_IISR6_ILACIN204         (0x1u<<12)
#define IAC_IISR6_ILACIN203         (0x1u<<11)
#define IAC_IISR6_ILACIN202         (0x1u<<10)
#define IAC_IISR6_ILACIN201         (0x1u<<9)
#define IAC_IISR6_ILACIN200         (0x1u<<8)
#define IAC_IISR6_ILACIN199         (0x1u<<7)
#define IAC_IISR6_ILACIN198         (0x1u<<6)
#define IAC_IISR6_ILACIN197         (0x1u<<5)
#define IAC_IISR6_ILACIN196         (0x1u<<4)
#define IAC_IISR6_ILACIN195         (0x1u<<3)
#define IAC_IISR6_ILACIN194         (0x1u<<2)
#define IAC_IISR6_ILACIN193         (0x1u<<1)
#define IAC_IISR6_ILACIN192         (0x1u<<0)

#define IAC_IISR6_ILACIN223_B_0X0   (0x0u<<31)
#define IAC_IISR6_ILACIN223_B_0X1   (0x1u<<31)
#define IAC_IISR6_ILACIN222_B_0X0   (0x0u<<30)
#define IAC_IISR6_ILACIN222_B_0X1   (0x1u<<30)
#define IAC_IISR6_ILACIN221_B_0X0   (0x0u<<29)
#define IAC_IISR6_ILACIN221_B_0X1   (0x1u<<29)
#define IAC_IISR6_ILACIN220_B_0X0   (0x0u<<28)
#define IAC_IISR6_ILACIN220_B_0X1   (0x1u<<28)
#define IAC_IISR6_ILACIN219_B_0X0   (0x0u<<27)
#define IAC_IISR6_ILACIN219_B_0X1   (0x1u<<27)
#define IAC_IISR6_ILACIN218_B_0X0   (0x0u<<26)
#define IAC_IISR6_ILACIN218_B_0X1   (0x1u<<26)
#define IAC_IISR6_ILACIN217_B_0X0   (0x0u<<25)
#define IAC_IISR6_ILACIN217_B_0X1   (0x1u<<25)
#define IAC_IISR6_ILACIN216_B_0X0   (0x0u<<24)
#define IAC_IISR6_ILACIN216_B_0X1   (0x1u<<24)
#define IAC_IISR6_ILACIN215_B_0X0   (0x0u<<23)
#define IAC_IISR6_ILACIN215_B_0X1   (0x1u<<23)
#define IAC_IISR6_ILACIN214_B_0X0   (0x0u<<22)
#define IAC_IISR6_ILACIN214_B_0X1   (0x1u<<22)
#define IAC_IISR6_ILACIN213_B_0X0   (0x0u<<21)
#define IAC_IISR6_ILACIN213_B_0X1   (0x1u<<21)
#define IAC_IISR6_ILACIN212_B_0X0   (0x0u<<20)
#define IAC_IISR6_ILACIN212_B_0X1   (0x1u<<20)
#define IAC_IISR6_ILACIN211_B_0X0   (0x0u<<19)
#define IAC_IISR6_ILACIN211_B_0X1   (0x1u<<19)
#define IAC_IISR6_ILACIN210_B_0X0   (0x0u<<18)
#define IAC_IISR6_ILACIN210_B_0X1   (0x1u<<18)
#define IAC_IISR6_ILACIN209_B_0X0   (0x0u<<17)
#define IAC_IISR6_ILACIN209_B_0X1   (0x1u<<17)
#define IAC_IISR6_ILACIN208_B_0X0   (0x0u<<16)
#define IAC_IISR6_ILACIN208_B_0X1   (0x1u<<16)
#define IAC_IISR6_ILACIN207_B_0X0   (0x0u<<15)
#define IAC_IISR6_ILACIN207_B_0X1   (0x1u<<15)
#define IAC_IISR6_ILACIN206_B_0X0   (0x0u<<14)
#define IAC_IISR6_ILACIN206_B_0X1   (0x1u<<14)
#define IAC_IISR6_ILACIN205_B_0X0   (0x0u<<13)
#define IAC_IISR6_ILACIN205_B_0X1   (0x1u<<13)
#define IAC_IISR6_ILACIN204_B_0X0   (0x0u<<12)
#define IAC_IISR6_ILACIN204_B_0X1   (0x1u<<12)
#define IAC_IISR6_ILACIN203_B_0X0   (0x0u<<11)
#define IAC_IISR6_ILACIN203_B_0X1   (0x1u<<11)
#define IAC_IISR6_ILACIN202_B_0X0   (0x0u<<10)
#define IAC_IISR6_ILACIN202_B_0X1   (0x1u<<10)
#define IAC_IISR6_ILACIN201_B_0X0   (0x0u<<9)
#define IAC_IISR6_ILACIN201_B_0X1   (0x1u<<9)
#define IAC_IISR6_ILACIN200_B_0X0   (0x0u<<8)
#define IAC_IISR6_ILACIN200_B_0X1   (0x1u<<8)
#define IAC_IISR6_ILACIN199_B_0X0   (0x0u<<7)
#define IAC_IISR6_ILACIN199_B_0X1   (0x1u<<7)
#define IAC_IISR6_ILACIN198_B_0X0   (0x0u<<6)
#define IAC_IISR6_ILACIN198_B_0X1   (0x1u<<6)
#define IAC_IISR6_ILACIN197_B_0X0   (0x0u<<5)
#define IAC_IISR6_ILACIN197_B_0X1   (0x1u<<5)
#define IAC_IISR6_ILACIN196_B_0X0   (0x0u<<4)
#define IAC_IISR6_ILACIN196_B_0X1   (0x1u<<4)
#define IAC_IISR6_ILACIN195_B_0X0   (0x0u<<3)
#define IAC_IISR6_ILACIN195_B_0X1   (0x1u<<3)
#define IAC_IISR6_ILACIN194_B_0X0   (0x0u<<2)
#define IAC_IISR6_ILACIN194_B_0X1   (0x1u<<2)
#define IAC_IISR6_ILACIN193_B_0X0   (0x0u<<1)
#define IAC_IISR6_ILACIN193_B_0X1   (0x1u<<1)
#define IAC_IISR6_ILACIN192_B_0X0   (0x0u<<0)
#define IAC_IISR6_ILACIN192_B_0X1   (0x1u<<0)

// IISR7 Configuration

#define IAC_IISR7_ILACIN255         (0x1u<<31)
#define IAC_IISR7_ILACIN254         (0x1u<<30)
#define IAC_IISR7_ILACIN253         (0x1u<<29)
#define IAC_IISR7_ILACIN252         (0x1u<<28)
#define IAC_IISR7_ILACIN251         (0x1u<<27)
#define IAC_IISR7_ILACIN250         (0x1u<<26)
#define IAC_IISR7_ILACIN249         (0x1u<<25)
#define IAC_IISR7_ILACIN248         (0x1u<<24)
#define IAC_IISR7_ILACIN247         (0x1u<<23)
#define IAC_IISR7_ILACIN246         (0x1u<<22)
#define IAC_IISR7_ILACIN245         (0x1u<<21)
#define IAC_IISR7_ILACIN244         (0x1u<<20)
#define IAC_IISR7_ILACIN243         (0x1u<<19)
#define IAC_IISR7_ILACIN242         (0x1u<<18)
#define IAC_IISR7_ILACIN241         (0x1u<<17)
#define IAC_IISR7_ILACIN240         (0x1u<<16)
#define IAC_IISR7_ILACIN239         (0x1u<<15)
#define IAC_IISR7_ILACIN238         (0x1u<<14)
#define IAC_IISR7_ILACIN237         (0x1u<<13)
#define IAC_IISR7_ILACIN236         (0x1u<<12)
#define IAC_IISR7_ILACIN235         (0x1u<<11)
#define IAC_IISR7_ILACIN234         (0x1u<<10)
#define IAC_IISR7_ILACIN233         (0x1u<<9)
#define IAC_IISR7_ILACIN232         (0x1u<<8)
#define IAC_IISR7_ILACIN231         (0x1u<<7)
#define IAC_IISR7_ILACIN230         (0x1u<<6)
#define IAC_IISR7_ILACIN229         (0x1u<<5)
#define IAC_IISR7_ILACIN228         (0x1u<<4)
#define IAC_IISR7_ILACIN227         (0x1u<<3)
#define IAC_IISR7_ILACIN226         (0x1u<<2)
#define IAC_IISR7_ILACIN225         (0x1u<<1)
#define IAC_IISR7_ILACIN224         (0x1u<<0)

#define IAC_IISR7_ILACIN255_B_0X0   (0x0u<<31)
#define IAC_IISR7_ILACIN255_B_0X1   (0x1u<<31)
#define IAC_IISR7_ILACIN254_B_0X0   (0x0u<<30)
#define IAC_IISR7_ILACIN254_B_0X1   (0x1u<<30)
#define IAC_IISR7_ILACIN253_B_0X0   (0x0u<<29)
#define IAC_IISR7_ILACIN253_B_0X1   (0x1u<<29)
#define IAC_IISR7_ILACIN252_B_0X0   (0x0u<<28)
#define IAC_IISR7_ILACIN252_B_0X1   (0x1u<<28)
#define IAC_IISR7_ILACIN251_B_0X0   (0x0u<<27)
#define IAC_IISR7_ILACIN251_B_0X1   (0x1u<<27)
#define IAC_IISR7_ILACIN250_B_0X0   (0x0u<<26)
#define IAC_IISR7_ILACIN250_B_0X1   (0x1u<<26)
#define IAC_IISR7_ILACIN249_B_0X0   (0x0u<<25)
#define IAC_IISR7_ILACIN249_B_0X1   (0x1u<<25)
#define IAC_IISR7_ILACIN248_B_0X0   (0x0u<<24)
#define IAC_IISR7_ILACIN248_B_0X1   (0x1u<<24)
#define IAC_IISR7_ILACIN247_B_0X0   (0x0u<<23)
#define IAC_IISR7_ILACIN247_B_0X1   (0x1u<<23)
#define IAC_IISR7_ILACIN246_B_0X0   (0x0u<<22)
#define IAC_IISR7_ILACIN246_B_0X1   (0x1u<<22)
#define IAC_IISR7_ILACIN245_B_0X0   (0x0u<<21)
#define IAC_IISR7_ILACIN245_B_0X1   (0x1u<<21)
#define IAC_IISR7_ILACIN244_B_0X0   (0x0u<<20)
#define IAC_IISR7_ILACIN244_B_0X1   (0x1u<<20)
#define IAC_IISR7_ILACIN243_B_0X0   (0x0u<<19)
#define IAC_IISR7_ILACIN243_B_0X1   (0x1u<<19)
#define IAC_IISR7_ILACIN242_B_0X0   (0x0u<<18)
#define IAC_IISR7_ILACIN242_B_0X1   (0x1u<<18)
#define IAC_IISR7_ILACIN241_B_0X0   (0x0u<<17)
#define IAC_IISR7_ILACIN241_B_0X1   (0x1u<<17)
#define IAC_IISR7_ILACIN240_B_0X0   (0x0u<<16)
#define IAC_IISR7_ILACIN240_B_0X1   (0x1u<<16)
#define IAC_IISR7_ILACIN239_B_0X0   (0x0u<<15)
#define IAC_IISR7_ILACIN239_B_0X1   (0x1u<<15)
#define IAC_IISR7_ILACIN238_B_0X0   (0x0u<<14)
#define IAC_IISR7_ILACIN238_B_0X1   (0x1u<<14)
#define IAC_IISR7_ILACIN237_B_0X0   (0x0u<<13)
#define IAC_IISR7_ILACIN237_B_0X1   (0x1u<<13)
#define IAC_IISR7_ILACIN236_B_0X0   (0x0u<<12)
#define IAC_IISR7_ILACIN236_B_0X1   (0x1u<<12)
#define IAC_IISR7_ILACIN235_B_0X0   (0x0u<<11)
#define IAC_IISR7_ILACIN235_B_0X1   (0x1u<<11)
#define IAC_IISR7_ILACIN234_B_0X0   (0x0u<<10)
#define IAC_IISR7_ILACIN234_B_0X1   (0x1u<<10)
#define IAC_IISR7_ILACIN233_B_0X0   (0x0u<<9)
#define IAC_IISR7_ILACIN233_B_0X1   (0x1u<<9)
#define IAC_IISR7_ILACIN232_B_0X0   (0x0u<<8)
#define IAC_IISR7_ILACIN232_B_0X1   (0x1u<<8)
#define IAC_IISR7_ILACIN231_B_0X0   (0x0u<<7)
#define IAC_IISR7_ILACIN231_B_0X1   (0x1u<<7)
#define IAC_IISR7_ILACIN230_B_0X0   (0x0u<<6)
#define IAC_IISR7_ILACIN230_B_0X1   (0x1u<<6)
#define IAC_IISR7_ILACIN229_B_0X0   (0x0u<<5)
#define IAC_IISR7_ILACIN229_B_0X1   (0x1u<<5)
#define IAC_IISR7_ILACIN228_B_0X0   (0x0u<<4)
#define IAC_IISR7_ILACIN228_B_0X1   (0x1u<<4)
#define IAC_IISR7_ILACIN227_B_0X0   (0x0u<<3)
#define IAC_IISR7_ILACIN227_B_0X1   (0x1u<<3)
#define IAC_IISR7_ILACIN226_B_0X0   (0x0u<<2)
#define IAC_IISR7_ILACIN226_B_0X1   (0x1u<<2)
#define IAC_IISR7_ILACIN225_B_0X0   (0x0u<<1)
#define IAC_IISR7_ILACIN225_B_0X1   (0x1u<<1)
#define IAC_IISR7_ILACIN224_B_0X0   (0x0u<<0)
#define IAC_IISR7_ILACIN224_B_0X1   (0x1u<<0)
